[
    {
        "id": 2524,
        "name": "Tom Hardy",
        "biography": "Edward Thomas Hardy CBE (born 15 September 1977) is an English actor, producer, writer and former model. After studying acting at the Drama Centre London, he made his film debut in Ridley Scott's Black Hawk Down (2001). He has since been nominated for the Academy Award for Best Supporting Actor, two Critics' Choice Movie Awards and two British Academy Film Awards, receiving the 2011 BAFTA Rising Star Award. Hardy has also appeared in films such as Star Trek: Nemesis (2002), RocknRolla (2008), Bronson (2008), Warrior (2011), Tinker Tailor Soldier Spy (2011), Lawless (2012), This Means War (2012), Locke (2013), The Drop (2014), and The Revenant (2015), for which he received a nomination for an Academy Award. In 2015, he portrayed 'Mad' Max Rockatansky in Mad Max: Fury Road and both Kray twins in Legend. He has appeared in three Christopher Nolan films: Inception (2010) as Eames, The Dark Knight Rises (2012) as Bane, and Dunkirk (2017) as an RAF fighter-pilot. He starred as both Eddie Brock and Venom in the 2018 anti-hero film Venom and its sequel Venom: Let There Be Carnage (2021). Hardy's television roles include the HBO war drama mini-series Band of Brothers (2001), the BBC historical drama mini-series The Virgin Queen (2005), Bill Sikes in the BBC's mini-series Oliver Twist (2007), Heathcliff in ITV's Wuthering Heights (2009), the Sky 1 drama series The Take (2009), and as Alfie Solomons in the BBC historical crime drama series Peaky Blinders (2014–present). He created, co-produced, and took the lead in the eight-part historical fiction series Taboo (2017) on BBC One and FX. In 2020, he also contributed narration work to the Amazon docuseries All or Nothing: Tottenham Hotspur. Hardy has performed on both British and American stages. He was nominated for the Laurence Olivier Award for Most Promising Newcomer for his role as Skank in the production of In Arabia We'd All Be Kings (2003), and was awarded the 2003 Evening Standard Theatre Award for Outstanding Newcomer for his performances in both In Arabia We'd All Be Kings and Blood, in which he played Luca. He starred in the production of The Man of Mode (2007) and received positive reviews for his role in the play The Long Red Road (2010). Hardy is active in charity work and is an ambassador for the Prince's Trust. He was appointed a CBE in the 2018 Birthday Honours for services to drama. Description above from the Wikipedia article Tom Hardy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/d81K0RH8UX7tZj49tZaQhZ9ewH.jpg",
        "filmography": [
            "Star Trek: Nemesis (2002)",
            "Black Hawk Down (2001)",
            "Layer Cake (2004)",
            "The Reckoning (2004)",
            "Inception (2010)"
        ]
    },
    {
        "id": 5294,
        "name": "Chiwetel Ejiofor",
        "biography": "Chiwetelu Umeadi 'Chiwetel' Ejiofor (born on July 10, 1977) is an English actor. He attended London Academy of Music and Dramatic Art, but had to leave after a year after receiving the roll of Ens, in Steven Spielberg's historical drama, 'Amistad'. For his first leading film role in Dirty Pretty Things, he won a British Independent Film Award for best actor. He has portrayed Othello in numerous stage productions including Bloomsbury Theatre, Theatre Royal in Glasgow and Donmar Warehouse. He made his directorial debut in the short film Slapper, which he also wrote. He soon became well known after moving on to bigger roles in 'Inside Man' (2005), 'American Gangster' (2007), 'Children of Men' and Steve McQueen's '12 Years a Slave' (2012).",
        "profile_path": "https://image.tmdb.org/t/p/w500/kq5DDnqqofoRI0t6ddtRlsJnNPT.jpg",
        "filmography": [
            "Inside Man (2006)",
            "Love Actually (2003)",
            "Dirty Pretty Things (2002)",
            "Dirty Pretty Things (2002)",
            "American Gangster (2007)"
        ]
    },
    {
        "id": 36594,
        "name": "Juno Temple",
        "biography": "Juno Temple (born 21 July 1989) is a British actress. She has appeared in the films Notes on a Scandal (2006), Atonement (2007), The Other Boleyn Girl (2008), The Three Musketeers (2011), The Dark Knight Rises (2012), Magic Magic (2013), Maleficent (2014), Black Mass (2015), Unsane (2018), and Maleficent: Mistress of Evil (2019). Temple also has starred in the television series Vinyl (2016), Dirty John (2018–2019), Ted Lasso (2020–present), Little Birds (2020), and The Offer (2022), Year One (2009). Temple received the BAFTA Rising Star Award in 2013. She was nominated for two Primetime Emmy Awards and three Screen Actors Guild Awards for her role as Keeley Jones in Ted Lasso, in addition to being nominated for a Critics' Choice Television Award and a Satellite Award for her role as Bettye McCartt in The Offer.",
        "profile_path": "https://image.tmdb.org/t/p/w500/wMpZcKp7zaHnmNQooqbve33577Q.jpg",
        "filmography": [
            "Sin City: A Dame to Kill For (2014)",
            "Notes on a Scandal (2006)",
            "St. Trinian's (2007)",
            "Atonement (2007)",
            "Mr. Nobody (2009)"
        ]
    },
    {
        "id": 1861573,
        "name": "Clark Backo",
        "biography": "Clark Backo (born September 5, 1993) is a Canadian film and television actress, best known for her roles in the Apple TV+ series The Changeling, as well as on the hit Hulu comedy Letterkenny, where she played Rosie in a recurring role.",
        "profile_path": "https://image.tmdb.org/t/p/w500/d24KKFxfoql6PBsBPsejFgzhSlH.jpg",
        "filmography": [
            "Confession (2023)",
            "The List (2023)",
            "Sadie's Last Days on Earth (2016)",
            "Venom: The Last Dance (2024)",
            "Seven in Heaven (2018)"
        ]
    },
    {
        "id": 7026,
        "name": "Rhys Ifans",
        "biography": "Rhys Owain Evans (Welsh pronunciation: [r̥ɨːsˈivans]; born 22 July 1967), known as Rhys Ifans, is a Welsh actor. His portrayed roles in Notting Hill (1999), Kevin & Perry Go Large (2000), and Enduring Love (2004), in addition to Xenophilius Lovegood in Harry Potter and the Deathly Hallows—Part 1 (2010), Dr. Curt Connors / Lizard in The Amazing Spider-Man (2012) and Spider-Man: No Way Home (2021), and Grigori Rasputin in The King's Man (2021). His television roles include Hector DeJean in the Epix thriller series Berlin Station, Mycroft Holmes in the CBS series Elementary, and Otto Hightower in the HBO fantasy series House of the Dragon. Ifans was also formerly the frontman of the rock bands The Peth and Super Furry Animals. Description above from the Wikipedia article Rhys Ifans, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/1D670EEsbky3EtO7XLG32A09p92.jpg",
        "filmography": [
            "La Cha Cha (2021)",
            "Human Nature (2001)",
            "Notting Hill (1999)",
            "Hannibal Rising (2007)",
            "The 51st State (2001)"
        ]
    },
    {
        "id": 1267329,
        "name": "Lupita Nyong'o",
        "biography": "Lupita Amondi Nyong'o (born 1 March 1983) is a Kenyan-Mexican actress and author. She began her career in Hollywood as a production assistant. In 2008, she made her acting debut with the short film East River and subsequently returned to Kenya to star in the television series Shuga (2009–2012). In 2009, she wrote, produced and directed the documentary In My Genes. She then pursued a master's degree in acting from the Yale School of Drama. She had her first feature film role as Patsey in 12 Years a Slave (2013), for which she received critical acclaim and won several awards, including the Academy Award for Best Supporting Actress. She became the first Kenyan and Mexican actress to win an Academy Award. She made her Broadway debut as a teenage orphan in the play Eclipsed (2015), for which she was nominated for a Tony Award for Best Actress in a Play. She went on to perform a motion capture role as Maz Kanata in the Star Wars sequel trilogy (2015–2019) and a lead voice role as Raksha in The Jungle Book (2016). Her career progressed with her role as Nakia in the Marvel Cinematic Universe superhero film Black Panther (2018) and her starring role in Jordan Peele's critically acclaimed horror film Us (2019). In addition to acting, she supports historic preservation. She is vocal about preventing sexual harassment and working for women's and animal rights. In 2014, she was named the most beautiful woman by People. She has also written a children's book named Sulwe (2019), which became a number-one New York Times Best-Seller. Also in 2019, she narrated the Discovery Channel docu-series Serengeti, which earned her a Primetime Emmy Award nomination for Outstanding Narrator. She was named among Africa's '50 Most Powerful Women' by Forbes in 2020. Description above is from the Wikipedia article Lupita Nyong'o, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/y40Wu1T742kynOqtwXASc5Qgm49.jpg",
        "filmography": [
            "Marvel Studios Assembled: The Making of Black Panther: Wakanda Forever (2023)",
            "2021 Rock & Roll Hall of Fame Induction Ceremony (2021)",
            "12 Years a Slave (2013)",
            "Worlds Beyond Earth (2020)",
            "Non-Stop (2014)"
        ]
    },
    {
        "id": 1253360,
        "name": "Pedro Pascal",
        "biography": "José Pedro Balmaceda Pascal (born April 2, 1975) is a Chilean-American actor. After nearly two decades of taking small roles in film and television, Pascal rose to prominence for portraying Oberyn Martell during the fourth season of the HBO fantasy series Game of Thrones (2014) and as Javier Peña in the Netflix crime series Narcos (2015–2017). Since 2019, he has starred as the title character in the Disney+ Star Wars series The Mandalorian and reprised his role in the spin-off series The Book of Boba Fett (2021). Since 2023, he has played Joel in the HBO drama series The Last of Us. He has appeared in the films The Adjustment Bureau (2011), The Great Wall (2016), Kingsman: The Golden Circle (2017), The Equalizer 2 (2018), Triple Frontier (2019), Wonder Woman 1984 (2020), and The Unbearable Weight of Massive Talent (2022).",
        "profile_path": "https://image.tmdb.org/t/p/w500/9VYK7oxcqhjd5LAH6ZFJ3XzOlID.jpg",
        "filmography": [
            "Community Table Read (2020)",
            "Burning Bridges (1996)",
            "Sweets (2015)",
            "Making of The Last of Us (2023)",
            "Burn Notice: The Fall of Sam Axe (2011)"
        ]
    },
    {
        "id": 1538851,
        "name": "Kit Connor",
        "biography": "Kit Sebastian Connor (born 8 March 2004) is an English actor. He has appeared in the films Get Santa (2014), Rocketman (2019) and Little Joe (2019). On television, he had a recurring role in the CBBC series Rocket's Island (2014–2015) and a voice role in the BBC One and HBO series His Dark Materials. He gained recognition for his starring role as Nick Nelson in the Netflix teen series Heartstopper (2022), for which he won the Children's and Family Emmy Award for Outstanding Lead Performance in 2022.",
        "profile_path": "https://image.tmdb.org/t/p/w500/gCIdbnV9D3lzTaOB0YtuKDz6Nt0.jpg",
        "filmography": [
            "Elton John: Glastonbury 2023 (2023)",
            "An Adventure in Space and Time (2013)",
            "The Wild Robot (2024)",
            "Get Santa (2014)",
            "The Mercy (2018)"
        ]
    },
    {
        "id": 2440,
        "name": "Bill Nighy",
        "biography": "William Francis Nighy (born 12 December 1949) is an English actor. Known for his work on screen and stage, he has received numerous awards, including two BAFTA Awards, a Golden Globe Award and nominations for an Academy Award and a Tony Award. Nighy started his career with the Everyman Theatre, Liverpool and made his London debut with the Royal National Theatre starting with The Illuminatus! in 1977. There he gained acclaim for his roles in David Hare's Pravda in 1985, Harold Pinter's Betrayal in 1991, Tom Stoppard's Arcadia in 1993, and Anton Chekov's The Seagull in 1994. He received a Laurence Olivier Award for Best Actor nomination for his performance in Blue/Orange in 2001. He made his Broadway debut in Hare's The Vertical Hour in 2006, and returned in the 2015 revival of Hare's Skylight earning a Tony Award for Best Actor in a Play nomination. Early film roles include in the comedies Still Crazy (1998), and Blow Dry (1999) before his breakout role in Love Actually (2003) which earned him a BAFTA Award for Best Supporting Actor. He soon gained recognition portraying Davy Jones in the Pirates of the Caribbean film series (2006-2007), and Viktor in the Underworld film series (2003-2009). Other films include Shaun of the Dead (2004), The Hitchhiker's Guide to the Galaxy (2005), The Constant Gardener (2005), Notes on a Scandal (2006), Hot Fuzz (2007), Valkyrie (2008), Harry Potter and the Deathly Hallows – Part 1 (2010), The Best Exotic Marigold Hotel (2012), About Time (2013), Emma (2020), and Living (2022), the last of these earning him his first career Academy Award nomination. Nighy has gained acclaim for his roles in television earning a British Academy Television Award for Best Actor for his performance in BBC One series State of Play (2003), and a Golden Globe Award for Best Actor for the BBC film Gideon's Daughter (2007). He's also known for his roles in HBO's The Girl in the Café (2006) and PBS's Page Eight (2012).",
        "profile_path": "https://image.tmdb.org/t/p/w500/ixFI2YCGNGJfwlpI8iyhvVZRg8C.jpg",
        "filmography": [
            "Pirates of the Caribbean: Dead Man's Chest (2006)",
            "Underworld (2003)",
            "Pirates of the Caribbean: At World's End (2007)",
            "Love Actually (2003)",
            "Notes on a Scandal (2006)"
        ]
    },
    {
        "id": 1381186,
        "name": "Stephanie Hsu",
        "biography": "Stephanie Ann Hsu (born November 25, 1990) is an American actress. She trained at NYU Tisch School of the Arts and began her career in experimental theatre before starring on Broadway, originating the roles of Christine Canigula in Be More Chill (2015–2019) and Karen the Computer in SpongeBob SquarePants: The Broadway Musical (2016–2017). In television, she is known for her recurring roles in The Marvelous Mrs. Maisel (2019–2023) and Awkwafina Is Nora from Queens (2020–2021). Hsu received critical acclaim and a nomination for the Academy Award for Best Supporting Actress for her dual role as Joy Wang and Jobu Tupaki in the film Everything Everywhere All at Once (2022). Her performance also garnered her nominations for a Golden Globe Award, a SAG Award and a Critics’ Choice Movie Award. Other notable film and television credits include supporting roles in The Marvelous Mrs. Maisel (2017-2023), Set It Up (2018), Shang-Chi and the Legend of the Ten Rings (2021), Poker Face (2023), Shortcomings (2023), American Born Chinese (2023), Joy Ride (2023), The Monkey King (2023), Leo (2023), and The Fall Guy (2024).",
        "profile_path": "https://image.tmdb.org/t/p/w500/8gb3lfIHKQAGOQyeC4ynQPsCiHr.jpg",
        "filmography": [
            "Leo (2023)",
            "Shortcomings (2023)",
            "Legendary Place (2018)",
            "Sucks To Be The Moon (2022)",
            "The Fall Guy (2024)"
        ]
    },
    {
        "id": 1882502,
        "name": "Lauren LaVera",
        "biography": "Lauren LaVera is an American actress, born in Philadelphia, Pennsylvania. Lauren is known for her roles in the Terrifier franchise (2022 - 2024), Marvel's Iron Fist (2017), Dispatches From Elsewhere (2020), and A Taste of Christmas (2020).",
        "profile_path": "https://image.tmdb.org/t/p/w500/qJYWq2oZcvHh7lnGskxkrYXCom0.jpg",
        "filmography": [
            "The Well (2024)",
            "Stalked (2022)v",
            "Miss Barton's Famous Cakes (2019)",
            "The Rainbow Prince (2022)",
            "Not for Nothing (2022)"
        ]
    },
    {
        "id": 1880016,
        "name": "David Howard Thornton",
        "biography": "David Howard Thornton (born November 30, 1979) is an American actor. He is an actor known for work in stage, film, and voice over. He is best known for his roles as Art the Clown in the Terrifier films, Grandpa Who in the 1st- 5th national tours of Dr. Seuss' How the Grinch Stole Christmas: The Musical, the voice of Shizoku and others in the video game Invizimals: The Lost Kingdom, The Joker in the YouTube series Nightwing Escalation, and as the eponymous character in the Christmas horror parody film The Mean One.",
        "profile_path": "https://image.tmdb.org/t/p/w500/9nYijs4ACzjg93zKezLiLmuRGvp.jpg",
        "filmography": [
            "The Horror We Make (2023)",
            "The Evolution of Horror Cinema Worldwide (2025)",
            "The Mean One (2022)",
            "Terrifier 3 (2024)",
            "Selfie King (2022)"
        ]
    },
    {
        "id": 3743767,
        "name": "Antonella Rose",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/sdqM1qQEjRuo460AuUOjFAH7kCm.jpg",
        "filmography": [
            "A Sudden Case of Christmas (2024)",
            "A Sudden Case of Christmas (2024)"
        ]
    },
    {
        "id": 2787720,
        "name": "Elliott Fullam",
        "biography": "Elliott Fullam is an actor and singer, known best for his role as Jonathan Shaw in the critically acclaimed horror films Terrifier 2 (2022) and Terrifier 3 (2024).",
        "profile_path": "https://image.tmdb.org/t/p/w500/dNsFLihmWfA2KCENbZCtq9AjSob.jpg",
        "filmography": [
            "The Pitchfork Retreat ()",
            "Terrifier 3 (2024)",
            "Terrifier 2 (2022)"
        ]
    },
    {
        "id": 1676771,
        "name": "Samantha Scaffidi",
        "biography": "Samantha Scaffidi was born as Samantha Nicole Scaffidi. She is an actress and producer, known for Demon Hole (2017), The Grind TV 1.0 (2016) and Terrifier (2016).",
        "profile_path": "https://image.tmdb.org/t/p/w500/jwd0XXuc4ibXAXjOxmhsFP0fQEO.jpg",
        "filmography": [
            "Throuple (2015)",
            "Terrifier 3 (2024)",
            "The Things We Left Unsaid (2022)",
            "Sam (2015)",
            "Demon Hole (2017)"
        ]
    },
    {
        "id": 1683343,
        "name": "Cailee Spaeny",
        "biography": "Cailee Spaeny (born July 24, 1998) is an American actress. Spaeny's first major role was in the science fiction film Pacific Rim Uprising (2018). She followed this appearing in the neo-noir film Bad Times at the El Royale (2018), the biographical films On the Basis of Sex and Vice (both 2018), the fantasy film The Craft: Legacy (2020), and the miniseries Devs (2020) and Mare of Easttown (2021). Spaeny portrayed Priscilla Presley in the biographical film Priscilla (2023), for which she received the Volpi Cup for Best Actress and a nomination for the Golden Globe Award for Best Actress in a Motion Picture – Drama. Further recognition came in 2024 for starring in the war film Civil War and the horror film Alien: Romulus.",
        "profile_path": "https://image.tmdb.org/t/p/w500/aoW7jgs9PL3Q0sWt6bGIhWAcBuW.jpg",
        "filmography": [
            "The Making of Priscilla (2023)",
            "Vice (2018)",
            "Unlimited World (2022)",
            "Priscilla (2023)",
            "Alien: Romulus (2024)"
        ]
    },
    {
        "id": 2761308,
        "name": "David Jonsson",
        "biography": "David Jonsson (born 4 September 1993) is a British actor. He began his career on the West End. He is known for his roles in the BBC Two and HBO series Industry (2020–), the film Rye Lane (2023), and Alien: Romulus (2024). In 2022, Jonsson appeared on the Evening Standard list of Londoners to watch and was one of British GQ's Men of the Year Honourees. He was named a 2023 Bright Young Thing by Tatler. The description above is from the Wikipedia article David Jonsson, licensed under CC-BY-SA. Full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/nIT9PmgMHHwSYG39hjqL6vv3TWU.jpg",
        "filmography": [
            "Bonhoeffer: Pastor. Spy. Assassin. (2024)",
            "Alien: Romulus (2024)",
            "Pray (2023)",
            "Rye Lane (2023)",
            "Meat Puppet (2024)"
        ]
    },
    {
        "id": 2164506,
        "name": "Archie Renaux",
        "biography": "Archie James Beale (born 22 November 1997), known professionally as Archie Renaux, is an English actor and model. He stars in the Netflix series Shadow and Bone. He appeared in the BBC One miniseries Gold Digger.",
        "profile_path": "https://image.tmdb.org/t/p/w500/uTd18t2VJovN2jSJyhuG8Yy3PV6.jpg",
        "filmography": [
            "Alien: Romulus (2024)",
            "Catherine Called Birdy (2022)",
            "The Other Zoey (2023)",
            "The Greatest Beer Run Ever (2022)",
            "Upgraded (2024)"
        ]
    },
    {
        "id": 1428070,
        "name": "Isabela Merced",
        "biography": "sabela Yolanda Moner (born July 10, 2001), known professionally as Isabela Merced since 2019, is an American actress and singer. She played the lead role of CJ Martin on the Nickelodeon television series 100 Things to Do Before High School (2014–2016) and voiced Kate in Nickelodeon's animated spinoff series Dora and Friends: Into the City! (2014–2017). In film, she has played Izabella in Transformers: The Last Knight (2017), Lizzy in Instant Family (2018), Isabel in Sicario: Day of the Soldado (2018), the titular character in Dora and the Lost City of Gold (2019), and Rachel Cooper in the Netflix film Sweet Girl (2021).",
        "profile_path": "https://image.tmdb.org/t/p/w500/cQlaWpBzyPx4p6PDz0cr1Y0DrWY.jpg",
        "filmography": [
            "Alien: Romulus (2024)",
            "Turtles All the Way Down (2024)",
            "Superman (2025)",
            "Madame Web (2024)",
            "Father of the Bride (2022)"
        ]
    },
    {
        "id": 2304140,
        "name": "Spike Fearn",
        "biography": "Spike E Fearn is an English actor. On television, he is known for his role in the ITVX teen drama Tell Me Everything (2022–2024). His films include Alien: Romulus (2024). He was named a 2024 Screen International Star of Tomorrow.",
        "profile_path": "https://image.tmdb.org/t/p/w500/o1WcXkDdlN5wdL5WIuGXNpNouZ9.jpg",
        "filmography": [
            "Alien: Romulus (2024)",
            "The Batman (2022)",
            "The Amazing Mr. Blunden (2021)",
            "Aftersun (2022)",
            "Back to Black (2024)"
        ]
    },
    {
        "id": 10859,
        "name": "Ryan Reynolds",
        "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020). Reynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards.",
        "profile_path": "https://image.tmdb.org/t/p/w500/algQ1VEno2W9SesoArWcZTeF617.jpg",
        "filmography": [
            "X-Men Origins: Wolverine (2009)",
            "Just Friends (2005)",
            "The Amityville Horror (2005)",
            "The In-Laws (2003)",
            "Fireflies in the Garden (2008)"
        ]
    },
    {
        "id": 6968,
        "name": "Hugh Jackman",
        "biography": "Hugh Michael Jackman (born 12 October 1968) is an Australian actor. Beginning in theatre and television, he landed his breakthrough role as Wolverine / Logan in the X-Men film series (2000–2017), a tenure that earned him the Guinness World Record for 'longest career as a live-action Marvel superhero'. Jackman has received a Grammy Award, a Primetime Emmy Award, and two Tony Awards. During his career, Jackman has headlined films in various genres, including the romantic comedy Kate & Leopold (2001), the action-horror Van Helsing (2004), the drama The Prestige (2006), the period romance Australia (2008), the epic musical Les Misérables (2012), the thriller Prisoners (2013), the musical The Greatest Showman (2017), the political drama The Front Runner (2018), and the crime thriller Bad Education (2019). For his role as Jean Valjean in Les Misérables, Jackman was nominated for the Academy Award for Best Actor and won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and for The Greatest Showman, he received a Grammy Award for Best Soundtrack Album. He also provided voice roles in the animated films Flushed Away (2006), Rise of the Guardians (2012), and Missing Link (2019). Jackman is also known for his early theatre roles in Oklahoma! in 1998 and Carousel in 2002. On Broadway, Jackman won the 2004 Tony Award for Best Actor in a Musical for his role in The Boy from Oz. In 2021 he returned to the theatre as Harold Hill in the Broadway revival of The Music Man. A four-time host of the Tony Awards, he won an Emmy Award for hosting the 2005 ceremony. He also hosted the 81st Academy Awards in 2009. Jackman was appointed a Companion of the Order of Australia in the 2019 Queen's Birthday Honours for services to performing arts and to the global community.",
        "profile_path": "https://image.tmdb.org/t/p/w500/4Xujtewxqt6aU0Y81tsS9gkjizk.jpg",
        "filmography": [
            "Scoop (2006)",
            "The Prestige (2006)",
            "The Fountain (2006)",
            "X-Men Origins: Wolverine (2009)",
            "Kate & Leopold (2001)"
        ]
    },
    {
        "id": 2324569,
        "name": "Emma Corrin",
        "biography": "Emma-Louise Corrin (born 13 December 1995) is an English actor. They portrayed Diana, Princess of Wales in the fourth season of the Netflix historical drama The Crown (2020), for which they won a Golden Globe and were nominated for a Primetime Emmy Award. They have since starred in the 2022 romantic drama films My Policeman and Lady Chatterley's Lover, and in the 2023 thriller miniseries A Murder at the End of the World. In 2024, they played Cassandra Nova in the superhero film Deadpool & Wolverine.",
        "profile_path": "https://image.tmdb.org/t/p/w500/wqGOVOsHzZaHeHymIS40elGCnY0.jpg",
        "filmography": [
            "Good Grief (2023)",
            "Deadpool & Wolverine (2024)",
            "Nosferatu (2024)",
            "Misbehaviour (2020)",
            "Alex's Dream (2018)"
        ]
    },
    {
        "id": 15576,
        "name": "Matthew Macfadyen",
        "biography": "David Matthew Macfadyen (born 17 October 1974) is an English actor. Known for his performances on stage and screen, he gained prominence for his role as Mr. Darcy in Joe Wright's Pride & Prejudice (2005). He starred as Tom Wambsgans in the HBO drama series Succession (2018–2023), for which he has received two Primetime Emmy Awards, two BAFTA Awards, and a Screen Actors Guild Award. Macfadyen is also known for his roles in films such as Death at a Funeral (2007), Frost/Nixon (2008), Anna Karenina (2012), The Assistant (2019), and Operation Mincemeat (2021). He made his television debut in 1998 as Hareton Earnshaw in Wuthering Heights. He portrayed Tom Quinn in the BBC One spy series Spooks (2002–04, 2011), and Inspector Edmund Reid in the BBC mystery series Ripper Street (2012–2016). He also starred as Henry Wilcox in Kenneth Lonergan's miniseries Howards End and Charles Ingram in the Stephen Frears' limited series Quiz (2020).",
        "profile_path": "https://image.tmdb.org/t/p/w500/2FF3Yjxd7DYR4EIJL6s2GpKDMkJ.jpg",
        "filmography": [
            "In My Father's Den (2004)",
            "In My Father's Den (2004)",
            "Enigma (2001)",
            "Pride & Prejudice (2005)",
            "Robin Hood (2010)"
        ]
    },
    {
        "id": 1464650,
        "name": "Dafne Keen",
        "biography": "Dafne Keen Fernández (born 4 January 2005) is an English and Spanish actress. Born in Madrid, Keen made her debut as a child actor on the series The Refugees (2015). Her breakthrough role was as Laura in the superhero film Logan (2017). She starred as Lyra Belacqua in the television series His Dark Materials (2019–2022) and Jecki Lon in the Star Wars series The Acolyte (2024), and reprised the role of Laura in Deadpool & Wolverine (2024). Description above from the Wikipedia article Dafne Keen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/g325OIjIHrFr0te8ewPfhKQ2SKj.jpg",
        "filmography": [
            "Whistle ()",
            "Night Comes ()",
            "Deadpool & Wolverine (2024)",
            "Logan (2017)",
            "Ana (2020)"
        ]
    },
    {
        "id": 3416,
        "name": "Demi Moore",
        "biography": "Demi Moore (born Demetria Gene Guynes) is an American actress and film producer. After making her film debut in 1981, she appeared on the soap opera General Hospital and subsequently gained recognition as a member of the Brat Pack with roles in Blame It on Rio (1984), St. Elmo's Fire (1985), and About Last Night... (1986). Her starring role in Ghost (1990), the highest-grossing film of that year, earned her a Golden Globe nomination. She had further box-office success in the early 1990s, with the films A Few Good Men (1992), Indecent Proposal (1993), and Disclosure (1994). She portrayed Claire Donnelly in the drama film If These Walls Could Talk (1996), for which she was nominated for a Golden Globe Award and a Primetime Emmy Award. In 1996, Moore became the highest-paid actress in film history when she received an unprecedented $12.5 million salary to star in Striptease. She voiced the role of Esmeralda in The Hunchback of Notre Dame (1996) and The Hunchback of Notre Dame II (2002). Her next major role, G.I. Jane (1997), for which she shaved her head, was followed by a lengthy hiatus. She achieved further success in the following decades with the films Charlie's Angels: Full Throttle (2003), Bobby (2006), Mr. Brooks (2007), Margin Call (2011), and Rough Night (2017). In 2019, Moore released a memoir titled Inside Out, which instantly became a New York Times Best Seller.",
        "profile_path": "https://image.tmdb.org/t/p/w500/brENIHiNrGUpoBMPqIEQwFNdIsc.jpg",
        "filmography": [
            "Ghost (1990)",
            "A Few Good Men (1992)",
            "The Scarlet Letter (1995)",
            "Wild Oats (2016)",
            "The Hunchback of Notre Dame (1996)"
        ]
    },
    {
        "id": 1392137,
        "name": "Margaret Qualley",
        "biography": "Sarah Margaret Qualley (born October 23, 1994) is an American actress. The daughter of actress Andie MacDowell, she trained as a ballerina in her youth and briefly pursued a career in modeling. She made her acting debut with a minor role in the 2013 drama film Palo Alto and gained recognition for playing a troubled teenager in the HBO drama series The Leftovers (2014–2017). Qualley then appeared in the dark comedy The Nice Guys (2016) and in Netflix's supernatural thriller Death Note (2017). Qualley gained acclaim and a nomination for a Primetime Emmy Award for portraying actress and dancer Ann Reinking in the FX biographical drama miniseries Fosse/Verdon (2019) and the title role in the Netflix drama miniseries Maid (2021). Her biggest commercial success came with Quentin Tarantino's comedy-drama Once Upon a Time in Hollywood (2019).",
        "profile_path": "https://image.tmdb.org/t/p/w500/jStNyMj3acpLuH48awLVLqqlyaV.jpg",
        "filmography": [
            "The Substance (2024)",
            "L'Américaine (2015)",
            "Poor Things (2023)",
            "Drive-Away Dolls (2024)",
            "Love Me Like You Hate Me (2020)"
        ]
    },
    {
        "id": 6065,
        "name": "Dennis Quaid",
        "biography": "Dennis William Quaid (born April 9, 1954) is an American actor. He became known during the 1980s after appearing in several successful films, including as Mike Brody in Jaws 3-D (1983), Alex Gardner in Dreamscape (1984), Remy McSwain in The Big Easy (1987), Tuck Pendleton in Innerspace (1987), Jefferson 'Jeff' Blue in Undercover Blues (1993), Bowen in Dragonheart (1996), Joe Doe/William in Gang Related (1997), Frank Towns in Flight of the Phoenix (2004), Jack Hall in The Day After Tomorrow (2004) and Reverend Shaw Moore in Footloose (2011).",
        "profile_path": "https://image.tmdb.org/t/p/w500/lMaDAJHzsKH7U3dln2B3kY3rOhE.jpg",
        "filmography": [
            "The Day After Tomorrow (2004)",
            "Savior (1998)",
            "Playing by Heart (1998)",
            "Frequency (2000)",
            "Traffic (2000)"
        ]
    },
    {
        "id": 2313436,
        "name": "Edward Hamilton-Clark",
        "biography": "Edward Hamilton-Clark is a Canadian actor who provided the motion capture for Ash and the voice for Glenn Sanders in Heavy Rain. He has also had roles in movies, TV series, and video games such as Bon voyage and Female Agents.",
        "profile_path": "https://image.tmdb.org/t/p/w500/q1EWL2z2xMcbf84TpOTqGs6Csxs.jpg",
        "filmography": [
            "Female Agents (2008)",
            "The Substance (2024)",
            "Bon Voyage (2003)",
            "Number One (2017)"
        ]
    },
    {
        "id": 1508131,
        "name": "Gore Abrams",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/bKMTqbl0FYlzIC6aTMKQZNAhhXK.jpg",
        "filmography": [
            "Marinette (2023)",
            "The Substance (2024)",
            "Hell House LLC (2015)",
            "Summum Bonum (2014)",
            "The Vixens (2015)"
        ]
    },
    {
        "id": 74568,
        "name": "Chris Hemsworth",
        "biography": "Chris Hemsworth (born 11 August 1983) is an Australian actor. He is best known for his roles as Kim Hyde in the Australian TV series Home and Away (2004) and as Thor in the Marvel Cinematic Universe films Thor (2011), The Avengers (2012), Thor: The Dark World (2013), Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019), and Thor: Love and Thunder (2022). He has also appeared in the science fiction action film Star Trek (2009), the thriller adventure A Perfect Getaway (2009), the horror comedy The Cabin in the Woods (2012), the dark fantasy action film Snow White and the Huntsman (2012), the war film Red Dawn (2012) and the biographical sports drama film Rush (2013).",
        "profile_path": "https://image.tmdb.org/t/p/w500/piQGdoIQOF3C1EI5cbYZLAW1gfj.jpg",
        "filmography": [
            "Thor (2011)",
            "Team Darryl (2018)",
            "The Cabin in the Woods (2012)",
            "The Avengers (2012)",
            "A Perfect Getaway (2009)"
        ]
    },
    {
        "id": 226366,
        "name": "Brian Tyree Henry",
        "biography": "Brian Tyree Henry (born March 31, 1982) is an American actor. He is best known for his role as Alfred 'Paper Boi' Miles in the FX comedy-drama series Atlanta (2016–2022), for which he received a Primetime Emmy Award nomination for Outstanding Supporting Actor in a Comedy Series. He is also known for his performances in Boardwalk Empire, How to Get Away with Murder, and This Is Us. Henry made his film breakthrough in 2018 with starring roles in Steve McQueen's heist film Widows, Barry Jenkins' romantic drama film If Beale Street Could Talk, and the animated superhero film Spider-Man: Into the Spider-Verse. He's since appeared in Joker (2019), Godzilla vs. Kong (2021), The Woman in the Window (2021), and Bullet Train (2022). He portrayed Phastos in the Marvel Cinematic Universe film Eternals (2021). In 2022, he starred in Causeway (2022) which earned him a nomination for an Academy Award for Best Supporting Actor. He has also appeared on stage, making his debut performance in the Shakespeare in the Park production of Romeo and Juliet (2007), and acting in various plays at the Public Theatre, before appearing in the original Broadway cast of The Book of Mormon (2011). In 2014 he appeared in the off-Broadway musical The Fortress of Solitude. For his performance in the 2018 Broadway revival of Kenneth Lonergan's play Lobby Hero, he received a Tony Award nomination for Best Featured Actor in a Play.",
        "profile_path": "https://image.tmdb.org/t/p/w500/2MsJh0bpyzwvOUnXOltHp3j85Pb.jpg",
        "filmography": [
            "Eternals (2021)",
            "The Magician's Elephant (2023)",
            "Transformers One (2024)",
            "Marvel Studios Assembled: The Making of Eternals (2022)",
            "Spider-Man: Across the Spider-Verse (2023)"
        ]
    },
    {
        "id": 1245,
        "name": "Scarlett Johansson",
        "biography": "Scarlett Ingrid Johansson (born November 22, 1984) is an American actress. The world's highest-paid actress in 2018 and 2019, she has featured multiple times on the Forbes Celebrity 100 list. Her films have grossed over $14.3 billion worldwide, making Johansson the ninth-highest-grossing box office star of all time. She has received various accolades, including a Tony Award and a British Academy Film Award, in addition to nominations for two Academy Awards and five Golden Globe Awards. Johansson aspired to be an actress from an early age and first appeared on stage in an Off-Broadway play as a child actor. She made her film debut in the fantasy comedy North (1994), and gained early recognition for her roles in Manny & Lo (1996), The Horse Whisperer (1998), and Ghost World (2001). Johansson shifted to adult roles in 2003 with her performances in Lost in Translation, which won her a BAFTA Award for Best Actress, and Girl with a Pearl Earring. She was nominated for Golden Globe Awards for these films, and for playing a troubled teenager in the drama A Love Song for Bobby Long (2004) and a seductress in psychological thriller Match Point (2005). The latter was her first collaboration with Woody Allen, who later directed her in Scoop (2006) and Vicky Cristina Barcelona (2008). Johansson's other works of this period include The Prestige (2006) and the albums Anywhere I Lay My Head (2008) and Break Up (2009), both of which charted on the Billboard 200. In 2010, Johansson debuted on Broadway in a revival of A View from the Bridge, which won her a Tony Award for Best Featured Actress, and began portraying Black Widow in the Marvel Cinematic Universe film Iron Man 2. She reprised the role in eight films, most recently in her solo feature Black Widow (2021), gaining global recognition for her performances. During this period, Johansson starred in the science fiction films Her (2013), Under the Skin (2013) and Lucy (2014). She received two simultaneous Academy Award nominations—Best Actress and Best Supporting Actress—for the respective roles of an actress going through a divorce in the drama Marriage Story (2019) and a single mother in Nazi Germany in the satire Jojo Rabbit (2019). Labeled a sex symbol, Johansson has been referred to as one of the world's most attractive women by various media outlets. She is a prominent brand endorser and supports several charitable causes. Divorced from actor Ryan Reynolds and businessman Romain Dauriac, Johansson has been married to comedian Colin Jost since 2020. She has two children, one with Dauriac and another with Jost.",
        "profile_path": "https://image.tmdb.org/t/p/w500/6NsMbJXRlDZuDzatN2akFdGuTvx.jpg",
        "filmography": [
            "Lost in Translation (2003)",
            "Scoop (2006)",
            "The Prestige (2006)",
            "The Horse Whisperer (1998)",
            "Iron Man 2 (2010)"
        ]
    },
    {
        "id": 298410,
        "name": "Keegan-Michael Key",
        "biography": "Keegan-Michael Key (born March 22, 1971, height (1.85 m) is an American actor and comedian best known for starring in the Comedy Central sketch series Key & Peele and for his six seasons as a cast member on MADtv. Early life Key was born in Southfield, Michigan and raised in Detroit. His father is African-American and his mother is European-American. He was adopted as a child. In 1989 he graduated from Shrine Catholic High School in Royal Oak, Michigan. Key attended the University of Detroit as an undergraduate and earned his Master of Fine Arts at the Pennsylvania State University School of Theatre. While at The University of Detroit Mercy, he was a brother of Phi Kappa Theta.",
        "profile_path": "https://image.tmdb.org/t/p/w500/vAR5gVXRG2Cl6WskXT99wgkAoH8.jpg",
        "filmography": [
            "Wonka (2023)",
            "The Super Mario Bros. Movie (2023)",
            "'Weird Al' Yankovic: White & Nerdy (2006)",
            "Julia Louis-Dreyfus: The Kennedy Center Mark Twain Prize (2018)",
            "Role Models (2008)"
        ]
    },
    {
        "id": 65717,
        "name": "Jon Hamm",
        "biography": "Jonathan Daniel 'Jon' Hamm (born March 10, 1971) is an American actor who works primarily in television. For much of the mid-1990s, Hamm lived in Los Angeles as a struggling actor appearing in small parts in multiple television series, including Providence, The Division, What About Brian and Related. In 2000 he made his feature film debut in Clint Eastwood's space adventure, Space Cowboys. The following year, Hamm appeared in the independent comedy, Kissing Jessica Stein (2001) in a minor role. Hamm gained global recognition for playing advertising executive Don Draper in the AMC drama series Mad Men, which premiered in July 2007. Hamm's performance earned him a Golden Globe Award for Best Actor in a Drama Series in 2008. Aside from his work on Mad Men, Hamm appeared in the 2008 science fiction remake, The Day the Earth Stood Still and claimed his first leading film role in the independent thriller Stolen (2010). Hamm had a supporting role in the 2010 crime film The Town. Description above from the Wikipedia article Jon Hamm, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/mrXE5fZbEDPc7BEE5G21J6qrwzi.jpg",
        "filmography": [
            "Shrek Forever After (2010)",
            "The Day the Earth Stood Still (2008)",
            "We Were Soldiers (2002)",
            "The Town (2010)",
            "Sucker Punch (2011)"
        ]
    },
    {
        "id": 56322,
        "name": "Amy Poehler",
        "biography": "Amy Poehler (/ˈpoʊlər/; born September 16, 1971) is an American actress, comedian, writer, producer, and director. After studying improv at Chicago's Second City and ImprovOlympic in the early 1990s, she co-founded the improvisational-comedy troupe Upright Citizens Brigade. The group moved to New York City in 1996 where their act became a half-hour sketch-comedy series on Comedy Central in 1998. Along with other members of the comedy group, Poehler is a founder of the Upright Citizens Brigade Theatre. Description above from the Wikipedia article Amy Poehler, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "profile_path": "https://image.tmdb.org/t/p/w500/rwmvRonpluV6dCPiQissYrchvSD.jpg",
        "filmography": [
            "Wet Hot American Summer (2001)",
            "Tenacious D in The Pick of Destiny (2006)",
            "Mean Girls (2004)",
            "Envy (2004)",
            "Southland Tales (2007)"
        ]
    },
    {
        "id": 1903874,
        "name": "Maya Hawke",
        "biography": "Maya Ray Thurman Hawke (born July 8, 1998) is an American actress, model, and singer-songwriter. After beginning her career in modeling, Hawke made her screen debut as Jo March in the 2017 BBC adaptation of Little Women. She portrays Robin Buckley in the Netflix science fiction series Stranger Things (2019–present), and Eleanor Levetan in Do Revenge (2022). She has played supporting roles in the films Once Upon a Time in Hollywood (2019), Human Capital, Mainstream (2020), and Fear Street Part One: 1994 (2021).",
        "profile_path": "https://image.tmdb.org/t/p/w500/evjbbHM1bzA6Ma5Ptjwa4WkYkkj.jpg",
        "filmography": [
            "Wildcat (2024)",
            "Asteroid City (2023)",
            "Honey I Sure Miss You (2020)",
            "Maestro (2023)",
            "Bay of Cadiz (2022)"
        ]
    },
    {
        "id": 3020876,
        "name": "Kensington Tallman",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/tBqawwg2VJq1V4mZjAOFQ7fnXNW.jpg",
        "filmography": [
            "Summer Camp (2024)",
            "Motorvation (2022)",
            "Inside Out 2 (2024)",
            "Inside Out 2 (2024)"
        ]
    },
    {
        "id": 51998,
        "name": "Liza Lapira",
        "biography": "Liza Lapira (born December 3, 1981) is an American actress, known for her roles as Melody 'Mel' Bayan on the CBS series The Equalizer, Helen-Alice on the sitcom Super Fun Night, Topher Brink's assistant Ivy on Dollhouse, Maggie Del Rosario on the series Huff, Special Agent Michelle Lee on the CBS series NCIS, Alva in Repo Men (2010), Trinh in Fast & Furious (2009), Kianna in the film 21 (2008), and Heather in Cloverfield (2008). She also co-starred in the short-lived sitcoms Traffic Light, Don't Trust the B---- in Apartment 23, Con Man, and 9JKL.",
        "profile_path": "https://image.tmdb.org/t/p/w500/o3jvQAGWtxi5rEycslhC6CY8BWX.jpg",
        "filmography": [
            "Repo Men (2010)",
            "21 (2008)",
            "Domino (2005)",
            "Fast & Furious (2009)",
            "Modern Persuasion (2020)"
        ]
    },
    {
        "id": 25147,
        "name": "Tony Hale",
        "biography": "Tony Hale (born September 30, 1970) is an American two time Emmy Award-winning film and television actor and author, best known for playing neurotic Byron 'Buster' Bluth on FOX's comedy series Arrested Development, as well as Gary Walsh, the downtrodden personal aide to Julia Louis-Dreyfus's Vice President Selina Meyers on HBO's Emmy Award-winning political comedy, Veep.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3dEyZgTye0Ec17VGKp0mJ3aU6ty.jpg",
        "filmography": [
            "Because I Said So (2007)",
            "Stranger Than Fiction (2006)",
            "Weathered (2009)",
            "The Year of Getting to Know Us (2008)",
            "The Informant! (2009)"
        ]
    },
    {
        "id": 2232,
        "name": "Michael Keaton",
        "biography": "Michael John Douglas (born September 5, 1951), known professionally as Michael Keaton, is an American actor, producer, and director. He is best known for portraying the DC Comics superhero Bruce Wayne / Batman in the films Batman (1989), Batman Returns (1992) and The Flash (2023), as well as Jack Butler in Mr. Mom (1983), Betelgeuse in Beetlejuice (1988), and Adrian Toomes / Vulture in Spider-Man: Homecoming (2017) and Morbius (2022) His breakout role was as fast-talking schemer Bill 'Blaze' Blazejowski in the 1982 film Night Shift (which was also Ron Howard's second job as a director). He later appeared in a variety of films ranging from dramas and romantic comedies to thriller and action films, such as Clean and Sober (1989), Much Ado About Nothing (1993), The Paper (1994), Multiplicity (1996), Jackie Brown (1997), Herbie: Fully Loaded (2005), The Other Guys (2010), Spotlight (2015), The Founder (2016), Dumbo (2019), The Trial of the Chicago 7 (2020) and Worth (2021). He has also provided voices for characters in animated films such as Porco Rosso (1992), Cars (2006), Toy Story 3 (2010), and Minions (2015). In 2021, he starred in the limited series Dopesick on Hulu. In 2014, Keaton garnered critical acclaim for his performance in Alejandro González Iñárritu's black comedy film Birdman, winning a Golden Globe Award for Best Actor—Motion Picture Musical or Comedy and receiving a nomination for the Academy Award for Best Actor. He had previously received a Golden Globe Award nomination for his performance in Live from Baghdad (2002) and five Screen Actors Guild Award nominations, which ultimately yielded three wins for his performances in Birdman (2014), Spotlight (2015), and The Trial of the Chicago 7 (2020).",
        "profile_path": "https://image.tmdb.org/t/p/w500/82rxrGxOqQW2NjKsIiNbDYHFfmb.jpg",
        "filmography": [
            "Jackie Brown (1997)",
            "Batman (1989)",
            "Batman Returns (1992)",
            "Cars (2006)",
            "Toy Story 3 (2010)"
        ]
    },
    {
        "id": 1920,
        "name": "Winona Ryder",
        "biography": "Winona Laura Horowitz (born October 29, 1971), known professionally as Winona Ryder, is an American actress. She is the recipient of several awards, including a Golden Globe Award, and has been nominated for two Academy Awards. She is known for taking on quirky roles in her earlier films, later playing more prominent roles in the 1990s. After Ryder's film debut in Lucas (1986), she gained attention with her performance in Tim Burton's Beetlejuice (1988). She further rose to prominence with major roles in Heathers (1989), Mermaids (1990), Edward Scissorhands (1990), and Bram Stoker's Dracula (1992). She garnered critical acclaim and two consecutive Academy Award nominations for her portrayals of socialite May Welland in Martin Scorsese's The Age of Innocence (1993) and Jo March in the fifth film adaptation of Little Women (1994). Her other films during this period were Reality Bites (1994), How to Make an American Quilt (1995), The Crucible (1996), Alien Resurrection (1997), Celebrity (1998), and Girl, Interrupted (1999), which she also executive-produced. In 2002, Ryder starred in the critically panned box office hit Mr. Deeds, after which her career declined and she took a break from films. In 2009, she returned in the high-profile film Star Trek. In 2010, she was nominated for two Screen Actors Guild Awards: as the lead actress in the television film When Love Is Not Enough: The Lois Wilson Story and as part of the cast of Black Swan. She also reunited with Burton for Frankenweenie (2012). She has starred as Joyce Byers in the Netflix science fiction horror series Stranger Things (2016–present), for which she has received Golden Globe and Screen Actors Guild nominations; and in 2020, she starred in the HBO drama miniseries The Plot Against America. Her relationship with Johnny Depp in the early 1990s and a 2001 arrest for shoplifting were both subjects of tabloid journalism. She has been open about her personal struggles with anxiety and depression. In 2000, Ryder received a star on the Hollywood Walk of Fame.",
        "profile_path": "https://image.tmdb.org/t/p/w500/nRB8LDsteteDJoUZPKLtu134GsS.jpg",
        "filmography": [
            "Edward Scissorhands (1990)",
            "Night on Earth (1991)",
            "The House of the Spirits (1993)",
            "Gone in the Night (2022)",
            "A Scanner Darkly (2006)"
        ]
    },
    {
        "id": 11514,
        "name": "Catherine O'Hara",
        "biography": "Catherine Anne O'Hara, a Canadian-American actress and comedienne, began her career at Second City Theatre in Toronto. She gained fame on SCTV alongside comedy icons like Rick Moranis and John Candy. Known for roles in films like 'After Hours', 'Beetlejuice','Home Alone', and 'The Nightmare Before Christmas', she's also renowned for her work in Christopher Guest's mockumentaries. Her versatility extends to voicing Grandma Frump in 'The Addams Family'. O'Hara received a Lifetime Artistic Achievement Award at the Governor General's Performance Arts Awards in 2020 and won a Golden Globe in 2021 for her role in 'Schitt's Creek'.",
        "profile_path": "https://image.tmdb.org/t/p/w500/cMBxHeztNVc8YXKcj084Mdd3f3U.jpg",
        "filmography": [
            "Brother Bear 2 (2006)",
            "Home Alone (1990)",
            "Home Alone 2: Lost in New York (1992)",
            "Beetlejuice (1988)",
            "After Hours (1985)"
        ]
    },
    {
        "id": 974169,
        "name": "Jenna Ortega",
        "biography": "Jenna Marie Ortega (born September 27, 2002) is an American actress. She began her career as a child actress, receiving recognition for her role as young Jane on The CW comedy-drama series Jane the Virgin (2014–2019). She had her breakthrough for starring as Harley Diaz on the Disney Channel series Stuck in the Middle (2016–2018), for which she won an Imagen Award. She played Ellie Alves in the second season of the Netflix thriller series You in 2019 and starred in the Netflix family film Yes Day (2021). Ortega received critical praise for her performance in the teen drama The Fallout (2021), and went on to star in the slasher films X (2022), Scream (2022) and its sequel Scream VI (2023), establishing herself as a scream queen. She starred as Wednesday Addams in the Netflix horror comedy series Wednesday (2022), for which she received nominations for a Primetime Emmy Award, a Golden Globe Award and a SAG Award. Description above from the Wikipedia article Jenna Ortega, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/q1NRzyZQlYkxLY07GO9NVPkQnu8.jpg",
        "filmography": [
            "Scream VI (2023)",
            "Studio 666 (2022)",
            "Beetlejuice Beetlejuice (2024)",
            "Iron Man 3 (2013)",
            "Finestkind (2023)"
        ]
    },
    {
        "id": 15009,
        "name": "Justin Theroux",
        "biography": "Justin Paul Theroux is an American actor and screenwriter. He is best known for his work with film director David Lynch in Mulholland Drive (2001) and Inland Empire (2006), his starring role as Kevin Garvey in the HBO series The Leftovers (2014–2017) and as Tom in The Girl on the Train (2016). He is also known as a screenwriter for films such as Tropic Thunder, Iron Man 2, Rock of Ages, and Zoolander 2.",
        "profile_path": "https://image.tmdb.org/t/p/w500/vnI9L0rXBAw1HeC0Q8hJGeJMGAW.jpg",
        "filmography": [
            "Miami Vice (2006)",
            "Mulholland Drive (2001)",
            "American Psycho (2000)",
            "Inland Empire (2006)",
            "Lynch 2 (2007)"
        ]
    },
    {
        "id": 1812,
        "name": "Michelle Williams",
        "biography": "Michelle Ingrid Williams (born September 9, 1980) is an American actress. Known primarily for starring in small-scale independent films with dark or tragic themes, she has received various accolades, including two Golden Globe Awards and a Primetime Emmy Award, in addition to nominations for five Academy Awards and a Tony Award. Williams, a daughter of politician and trader Larry R. Williams, began her career with television guest appearances and made her film debut in the family film Lassie in 1994. She gained emancipation from her parents at age fifteen, and soon achieved recognition for her leading role in the teen drama television series Dawson's Creek (1998–2003). This was followed by low-profile films, before having her breakthrough with the drama film Brokeback Mountain (2005). Williams went on to receive critical acclaim for playing emotionally troubled women coping with loss or loneliness in the independent dramas Wendy and Lucy (2008), Blue Valentine (2010), and Manchester by the Sea (2016). She won two Golden Globes for portraying Marilyn Monroe in the drama My Week with Marilyn (2011) and Gwen Verdon in the miniseries Fosse/Verdon (2019), in addition to a Primetime Emmy Award for the latter. Her highest-grossing releases came with the thriller Shutter Island (2010), the fantasy film Oz the Great and Powerful (2013), the musical The Greatest Showman (2017), and the superhero films Venom (2018) and Venom: Let There Be Carnage (2021). Williams has also led major studio films, such as Ridley Scott's crime thriller All the Money in the World (2017) and Steven Spielberg's drama The Fabelmans (2022). On Broadway, Williams starred in revivals of the musical Cabaret in 2014 and the drama Blackbird in 2016, for which she received a nomination for the Tony Award for Best Actress in a Play. She is an advocate for equal pay in the workplace. Consistently private about her personal life, Williams has a daughter from her relationship with actor Heath Ledger and was briefly married to musician Phil Elverum. She has two children with her second husband, theater director Thomas Kail.",
        "profile_path": "https://image.tmdb.org/t/p/w500/jn3BVMVbIptz2gc6Fhxo1qwJVvW.jpg",
        "filmography": [
            "Brokeback Mountain (2005)",
            "The Station Agent (2003)",
            "Land of Plenty (2004)",
            "I'm Not There (2007)",
            "Synecdoche, New York (2008)"
        ]
    },
    {
        "id": 53240,
        "name": "Riz Ahmed",
        "biography": "Rizwan 'Riz' Ahmed (born 1 December 1982), also known as Riz MC, is a British actor and rapper. As an actor, he is best known for his roles in Nightcrawler, Sound of Metal, Rogue One, Venom, The Sister Brothers, and the HBO miniseries The Night Of. He has received several awards, including an Academy Award and a Primetime Emmy Award with nominations for two Golden Globe Awards and two British Academy Film Awards.",
        "profile_path": "https://image.tmdb.org/t/p/w500/1uP9RaX7BGVx7XGTEmwObBJJzsC.jpg",
        "filmography": [
            "Shifty (2008)",
            "Relay (2024)",
            "The Road to Guantanamo (2006)",
            "Centurion (2010)",
            "Rage (2009)"
        ]
    },
    {
        "id": 87954,
        "name": "Scott Haze",
        "biography": "Scott Haze (born June 28, 1983) is an American actor and filmmaker.",
        "profile_path": "https://image.tmdb.org/t/p/w500/6cd3Jt8Vo52j8cRKbNf1j7cERhs.jpg",
        "filmography": [
            "12 Mighty Orphans (2021)",
            "Cop Dog (2008)",
            "The Seeding (2024)",
            "Child of God (2014)",
            "Midnight Special (2016)"
        ]
    },
    {
        "id": 81316,
        "name": "Reid Scott",
        "biography": "Reid Scott (born November 19, 1977) is an American film and television actor. He is best known for starring in television comedies as Dan Egan in HBO's Veep and Brando Dorff in TBS's My Boys, as well as films such as Venom (2018) and Sister (2014).",
        "profile_path": "https://image.tmdb.org/t/p/w500/kBAeDUDA7XJRXFLGNALlpE5d3lA.jpg",
        "filmography": [
            "Julia Louis-Dreyfus: The Kennedy Center Mark Twain Prize (2018)",
            "Bickford Shmeckler's Cool Ideas (2006)",
            "Amusement (2008)",
            "Losing Control (2012)",
            "Wildflower (2023)"
        ]
    },
    {
        "id": 504,
        "name": "Tim Robbins",
        "biography": "Timothy Francis Robbins (born October 16, 1958) is an American actor, screenwriter, director, producer, and musician. He is best known for his portrayal of Andy Dufresne in the prison drama film The Shawshank Redemption (1994).",
        "profile_path": "https://image.tmdb.org/t/p/w500/djLVFETFTvPyVUdrd7aLVykobof.jpg",
        "filmography": [
            "War of the Worlds (2005)",
            "The Secret Life of Words (2005)",
            "High Fidelity (2000)",
            "The Shawshank Redemption (1994)",
            "Bull Durham (1988)"
        ]
    },
    {
        "id": 192,
        "name": "Morgan Freeman",
        "biography": "Morgan Freeman (born June 1, 1937) is an American actor, director, and narrator. Noted for his distinctive deep voice, Freeman is known for his various roles in a wide variety of film genres. Throughout his career spanning over five decades, he has received multiple accolades, including an Academy Award, a Screen Actors Guild Award, and a Golden Globe Award. Born in Memphis, Tennessee, Freeman was raised in Mississippi where he began acting in school plays. He studied theatre arts in Los Angeles and appeared in stage productions in his early career. He rose to fame in the 1970s for his role in the children's television series The Electric Company. Freeman then appeared in the Shakespearean plays Coriolanus and Julius Caesar, the former of which earned him an Obie Award. His breakout role was in Street Smart (1987), playing a hustler, which earned him an Academy Award nomination for Best Supporting Actor. He achieved further stardom in Glory, the biographical drama Lean on Me, and comedy-drama Driving Miss Daisy (all 1989), the latter of which garnered him his first Academy Award nomination for Best Actor. In 1992, Freeman starred alongside Clint Eastwood in the western revenge film Unforgiven; this would be the first of several collaborations with Eastwood. In 1994, he starred in the prison drama The Shawshank Redemption for which he received another Academy Award nomination. Freeman also starred in David Fincher's crime thriller Se7en (1995), and Steven Spielberg's historical drama Amistad (1997). Freeman won the Academy Award for Best Supporting Actor for his performance in Clint Eastwood's 2004 sports drama Million Dollar Baby. In 2009, he received his fifth Oscar nomination for playing former South African President Nelson Mandela in Eastwood's Invictus. Freeman is also known for his performance as Lucius Fox in Christopher Nolan's The Dark Knight Trilogy (2005–2012). In addition to acting, Freeman has directed the drama Bopha! (1993). He also founded film production company Revelations Entertainment with business partner Lori McCreary. He is the recipient of the Kennedy Center Honor, the AFI Life Achievement Award, the Cecil B. DeMille Award, and the Screen Actors Guild Life Achievement Award. For his performances in theatrical productions, he has won three Obie Awards, one of the most prestigious honors for recognizing excellence in theatre. Description above from the Wikipedia article Morgan Freeman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/905k0RFzH0Kd6gx8oSxRdnr6FL.jpg",
        "filmography": [
            "Unforgiven (1992)",
            "Million Dollar Baby (2004)",
            "War of the Worlds (2005)",
            "The Dark Knight (2008)",
            "Lucky Number Slevin (2006)"
        ]
    },
    {
        "id": 4029,
        "name": "Bob Gunton",
        "biography": "Robert Patrick 'Bob' Gunton, Jr. (born November 15, 1945) is an American actor. He is known for playing strict, authoritarian characters, with his best known roles as Warden Samuel Norton in the 1994 prison film The Shawshank Redemption, Chief George Earle in 1993's Demolition Man, and President Juan Peron in the original Broadway cast of Evita. Description above from the Wikipedia article Bob Gunton , licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/ulbVvuBToBN3aCGcV028hwO0MOP.jpg",
        "filmography": [
            "The Shawshank Redemption (1994)",
            "The Perfect Storm (2000)",
            "Patch Adams (1998)",
            "Bats (1999)",
            "Scenes of the Crime (2002)"
        ]
    },
    {
        "id": 6573,
        "name": "William Sadler",
        "biography": "​From Wikipedia, the free encyclopedia.   William Thomas Sadler (born April 13, 1950) is an American actor who works in film and television. His television and motion picture roles have included Lewis Burwell 'Chesty' Puller in The Pacific, Luther Sloan in Star Trek Deep Space Nine, Sheriff Jim Valenti in Roswell, and—perhaps most notably—the Grim Reaper in Bill &amp; Ted's Bogus Journey, a role for which he was nominated for, and won, the Saturn Award for Best Supporting Actor, and his role as Colonel Stuart alongside Bruce Willis in Die Hard 2.",
        "profile_path": "https://image.tmdb.org/t/p/w500/rWeb2kjYCA7V9MC9kRwRpm57YoY.jpg",
        "filmography": [
            "The Shawshank Redemption (1994)",
            "Die Hard 2 (1990)",
            "Bill & Ted's Bogus Journey (1991)",
            "Rush (1991)",
            "Shadowheart (2009)"
        ]
    },
    {
        "id": 6574,
        "name": "Clancy Brown",
        "biography": "Clarence John Brown III (born January 5, 1959) is an American film, television and voice actor. He is known for his roles as the Kurgan in Highlander (1986), Captain Byron Hadley in The Shawshank Redemption (1994), Sergeant Charles Zim in Starship Troopers (1997), Brother Justin Crowe on the HBO series Carnivàle (2003–2005), Waylon 'Jock' Jeffcoat on the Showtime series Billions (2018–2019) and Stanley Thomas in Promising Young Woman (2020). His voice-over work includes Lex Luthor in the DC Animated Universe and various unrelated DC media, Doctor Neo Cortex in the Crash Bandicoot franchise (1997–2003), Mr. Krabs on SpongeBob SquarePants (1999–present), Surtur in Thor: Ragnarok (2017) and Lt. Hank Anderson in Detroit: Become Human (2018).",
        "profile_path": "https://image.tmdb.org/t/p/w500/1JeBRNG7VS7r64V9lOvej9bZXW5.jpg",
        "filmography": [
            "The Shawshank Redemption (1994)",
            "Tales of the Teenage Mutant Ninja Turtles: Super Shredder (2017)",
            "Starship Troopers (1997)",
            "Pathfinder (2007)",
            "Pet Sematary II (1992)"
        ]
    },
    {
        "id": 3084,
        "name": "Marlon Brando",
        "biography": "Marlon Brando Jr. (April 3, 1924 – July 1, 2004) was an American actor. Considered one of the most influential actors of the 20th century, he received numerous accolades throughout his career which spanned six decades, including two Academy Awards, two Golden Globe Awards, and three British Academy Film Awards. Brando was also an activist for many causes, notably the civil rights movement and various Native American movements. Having studied with Stella Adler in the 1940s, he is credited with being one of the first actors to bring the Stanislavski system of acting and method acting, derived from the Stanislavski system, to mainstream audiences. He initially gained acclaim and his first Academy Award nomination for Best Actor in a Leading Role for reprising the role of Stanley Kowalski in the 1951 film adaptation of Tennessee Williams' play A Streetcar Named Desire, a role that he originated successfully on Broadway. He received further praise, and a first Academy Award and Golden Globe Award, for his performance as Terry Malloy in On the Waterfront, and his portrayal of the rebellious motorcycle gang leader Johnny Strabler in The Wild One proved to be a lasting image in popular culture. Brando received Academy Award nominations for playing Emiliano Zapata in Viva Zapata! (1952); Mark Antony in Joseph L. Mankiewicz's 1953 film adaptation of Shakespeare's Julius Caesar; and Air Force Major Lloyd Gruver in Sayonara (1957), an adaptation of James A. Michener's 1954 novel. The 1960s saw Brando's career take a commercial and critical downturn. He directed and starred in the cult western One-Eyed Jacks, a critical and commercial flop, after which he delivered a series of notable box-office failures, beginning with Mutiny on the Bounty (1962). After ten years of underachieving, he agreed to do a screen test as Vito Corleone in Francis Ford Coppola's The Godfather (1972). He got the part and subsequently won his second Academy Award and Golden Globe Award in a performance critics consider among his greatest. He declined the Academy Award due to alleged mistreatment and misportrayal of Native Americans by Hollywood. The Godfather was one of the most commercially successful films of all time, and alongside his Oscar-nominated performance in Last Tango in Paris (1972), Brando reestablished himself in the ranks of top box-office stars. After a hiatus in the early 1970s, Brando was generally content with being a highly paid character actor in supporting roles, such as Jor-El in Superman (1978), as Colonel Kurtz in Apocalypse Now (1979), and Adam Steiffel in The Formula (1980), before taking a nine-year break from film. According to the Guinness Book of World Records, Brando was paid a record $3.7 million ($16 million in inflation-adjusted dollars) and 11.75% of the gross profits for 13 days' work on Superman. Brando was ranked by the American Film Institute as the fourth-greatest movie star among male movie stars whose screen debuts occurred in or before 1950. He was one of only six actors named in 1999 by Time magazine in its list of the 100 Most Important People of the Century. In this list, Time also designated Brando as the 'Actor of the Century'.",
        "profile_path": "https://image.tmdb.org/t/p/w500/fuTEPMsBtV1zE98ujPONbKiYDc2.jpg",
        "filmography": [
            "Apocalypse Now (1979)",
            "Superman Returns (2006)",
            "On the Waterfront (1954)",
            "The Freshman (1990)",
            "A Streetcar Named Desire (1951)"
        ]
    },
    {
        "id": 1158,
        "name": "Al Pacino",
        "biography": "Alfredo James Pacino (born April 25, 1940) is an American actor and filmmaker. In a career spanning over five decades, he has received many awards and nominations, including an Academy Award, two Tony Awards, and two Primetime Emmy Awards. He is one of the few performers to have received the Triple Crown of Acting. He has also been honored with the AFI Life Achievement Award, the Cecil B. DeMille Award, and the National Medal of Arts. A method actor and former student of the HB Studio and the Actors Studio, where he was taught by Charlie Laughton and Lee Strasberg, Pacino's film debut came at the age of 29 with a minor role in Me, Natalie (1969). He gained favorable notice for his first lead role as a heroin addict in The Panic in Needle Park (1971). Wide acclaim and recognition came with his breakthrough role as Michael Corleone in Francis Ford Coppola's The Godfather (1972), for which he received his first Oscar nomination, and he would reprise the role in the sequels The Godfather Part II (1974) and The Godfather Part III (1990). His portrayal of Michael Corleone is regarded as one of the greatest in film history. Pacino received nominations for the Academy Award for Best Actor for Serpico (1973), The Godfather Part II, Dog Day Afternoon (1975), and ...And Justice for All (1979), ultimately winning it for playing a blind military veteran in Scent of a Woman (1992). For his performances in The Godfather, Dick Tracy (1990), Glengarry Glen Ross (1992), and The Irishman (2019), he earned Best Supporting Actor Oscar nominations. Other notable portrayals include Tony Montana in Scarface (1983), Carlito Brigante in Carlito's Way (1993), Benjamin Ruggiero in Donnie Brasco (1997), and Lowell Bergman in The Insider (1999). He has also starred in the thrillers Heat (1995), The Devil's Advocate (1997), Insomnia (2002), and appeared in Once Upon a Time in Hollywood (2019). On television, Pacino has acted in several productions for HBO, including Angels in America (2003) and the Jack Kevorkian biopic You Don't Know Jack (2010), winning a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for each. Pacino currently stars in the Amazon Video web television series Hunters (2020–present). He has also had an extensive career on stage. He is a two-time Tony Award winner, in 1969 and 1977, for his performances in Does a Tiger Wear a Necktie? and The Basic Training of Pavlo Hummel. Pacino made his filmmaking debut with Looking for Richard (1996), directing and starring in this documentary about Richard III; Pacino had played the lead role on stage in 1977. He has also acted as Shylock in a 2004 feature film adaptation and 2010 stage production of The Merchant of Venice. Pacino directed and starred in Chinese Coffee (2000), Wilde Salomé (2011), and Salomé (2013). Since 1994, he has been the joint president of the Actors Studio.​From Wikipedia, the free encyclopedia",
        "profile_path": "https://image.tmdb.org/t/p/w500/m8HAAjq1T75JypKk0v1FFQn4ysZ.jpg",
        "filmography": [
            "Scarface (1983)",
            "The Godfather Part II (1974)",
            "The Godfather Part III (1990)",
            "Ocean's Thirteen (2007)",
            "Insomnia (2002)"
        ]
    },
    {
        "id": 3085,
        "name": "James Caan",
        "biography": "James Edmund Caan (/kɑːn/ KAHN; March 26, 1940 – July 6, 2022) was an American actor who was nominated for several awards, including four Golden Globes, an Emmy, and an Oscar. Caan was awarded a motion pictures star on the Hollywood Walk of Fame in 1978. After early roles in Howard Hawks's El Dorado (1966), Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), he came to prominence for playing his signature role of Sonny Corleone in The Godfather (1972), for which he was nominated for the Academy Award for Best Supporting Actor and the Golden Globe for Best Supporting Actor. He reprised the role of Sonny Corleone in The Godfather Part II (1974) with a cameo appearance at the end. Caan had significant roles in films such as Brian's Song (1971), Cinderella Liberty (1973), The Gambler (1974), Rollerball (1975), A Bridge Too Far (1977), and Alan J. Pakula's Comes a Horseman (1978). He had sporadically worked in film since the 1980s, with his notable performances including roles in Thief (1981), Gardens of Stone (1987), Misery (1990), Dick Tracy (1990), Bottle Rocket (1996), The Yards (2000), Dogville (2003), and Elf (2003). Description above from the Wikipedia article James Caan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/oRTyqWg0LReELvjms8WwkeTsDFS.jpg",
        "filmography": [
            "The Godfather Part II (1974)",
            "Dogville (2003)",
            "Alien Nation (1988)",
            "D'un film à l'autre (2011)",
            "Mickey Blue Eyes (1999)"
        ]
    },
    {
        "id": 3087,
        "name": "Robert Duvall",
        "biography": "Robert Selden Duvall (born January 5, 1931) is an American actor and filmmaker. He is the recipient of an Academy Award, four Golden Globe Awards, a BAFTA Award, two Primetime Emmy Awards and a Screen Actors Guild Award. Duvall began appearing in theater in the late 1950s, moving into television and film roles during the early 1960s, playing Boo Radley in To Kill a Mockingbird (1962) and appearing in Captain Newman, M.D. (1963), as Major Frank Burns in the blockbuster comedy M*A*S*H (1970) and the lead role in THX 1138 (1971), as well as Horton Foote's adaptation of William Faulkner's Tomorrow (1972), which was developed at The Actors Studio and is his personal favorite. This was followed by a series of critically lauded performances in commercially successful films. He has starred in numerous films and television series, including The Twilight Zone (1963), The Outer Limits (1964), The F.B.I. (1966), Bullitt (1968), True Grit (1969), Joe Kidd (1972), The Godfather (1972), The Godfather Part II (1974), The Conversation (1974), Network (1976), Apocalypse Now (1979), The Great Santini (1979), Tender Mercies (1983) (which earned him the Academy Award for Best Actor), The Natural (1984), Colors (1988), Lonesome Dove (1989), The Handmaid's Tale (1990), Days of Thunder (1990), Rambling Rose (1991), Falling Down (1993), Secondhand Lions (2003), The Judge (2014), and Widows (2018).​From Wikipedia, the free encyclopedia",
        "profile_path": "https://image.tmdb.org/t/p/w500/ybMmK25h4IVtfE7qrnlVp47RQlh.jpg",
        "filmography": [
            "Apocalypse Now (1979)",
            "The Godfather Part II (1974)",
            "Bullitt (1968)",
            "Colors (1988)",
            "Open Range (2003)"
        ]
    },
    {
        "id": 3086,
        "name": "Richard S. Castellano",
        "biography": "​From Wikipedia, the free encyclopedia. Richard Salvatore Castellano  (September 4, 1933 – December 10, 1988) was an American actor who is best remembered for his role as Peter Clemenza in The Godfather. Description above from the Wikipedia article Richard S. Castellano, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "profile_path": "https://image.tmdb.org/t/p/w500/1vr75BdHWret81vuSJ3ugiCBkxw.jpg",
        "filmography": [
            "A Lovely Way to Die (1968)",
            "The Godfather 1901–1959: The Complete Epic (1981)",
            "Night of the Juggler (1980)",
            "The Godfather (1972)",
            "Dear Mr. Wonderful (1982)"
        ]
    },
    {
        "id": 3092,
        "name": "Diane Keaton",
        "biography": "Diane Hall Keaton (born Diane Hall; January 5, 1946) is an American actress. Known for her idiosyncratic personality and fashion style, she has received various accolades throughout her career spanning over six decades, including an Academy Award, a British Academy Film Award, two Golden Globe Awards, and the AFI Life Achievement Award. Keaton began her career on stage appearing in the original 1968 Broadway production of the musical Hair. The next year, she received a Tony Award for Best Featured Actress in a Play nomination for her performance in Woody Allen's comic play Play it Again, Sam. She then made her screen debut in a small role in Lovers and Other Strangers (1970). She rose to prominence with her first major film role as Kay Adams-Corleone in Francis Ford Coppola's The Godfather (1972), a role she reprised in its sequels The Godfather Part II (1974) and The Godfather Part III (1990). The films that most shaped her career were those with director and co-star Woody Allen, beginning with the film adaptation of Play It Again, Sam (1972). Her next two films with Allen, Sleeper (1973) and Love and Death (1975), established her as a comic actor. Her fourth, the romantic comedy Annie Hall (1977), won her the Academy Award for Best Actress. To avoid being typecast as her Annie Hall persona, Keaton appeared in several dramatic films, starring in Looking for Mr. Goodbar (1977) and Allen's Interiors (1978), and received three more Academy Award nominations for playing feminist activist Louise Bryant in Reds (1981), a woman with leukemia in Marvin's Room (1996), and a dramatist in Something's Gotta Give (2003). Keaton's other popular films include Manhattan (1979), Baby Boom (1987), Father of the Bride (1991), Manhattan Murder Mystery (1993), Father of the Bride Part II (1995), The First Wives Club (1996), The Family Stone (2005), Morning Glory (2010), Finding Dory (2016) and Book Club (2018).",
        "profile_path": "https://image.tmdb.org/t/p/w500/9WfaYj5iBMyDX4IJyM1bdMRD3x6.jpg",
        "filmography": [
            "The Godfather Part II (1974)",
            "The Godfather Part III (1990)",
            "Because I Said So (2007)",
            "Manhattan (1979)",
            "Annie Hall (1977)"
        ]
    },
    {
        "id": 380,
        "name": "Robert De Niro",
        "biography": "Robert Anthony De Niro (born August 17, 1943) is an American actor. Known for his collaborations with Martin Scorsese, he is considered to be one of the best actors of his generation. De Niro is the recipient of various accolades, including two Academy Awards, a Golden Globe Award, the Cecil B. DeMille Award, and a Screen Actors Guild Life Achievement Award. In 2009, De Niro received the Kennedy Center Honor, and earned a Presidential Medal of Freedom from U.S. President Barack Obama in 2016. De Niro studied acting at HB Studio, Stella Adler Conservatory, and Lee Strasberg's Actors Studio. His first collaboration with Scorsese was with the 1973 film Mean Streets. De Niro earned two Academy Awards, one for Best Supporting Actor for his role as Vito Corleone in Francis Ford Coppola's The Godfather Part II (1974) and the other for Best Actor portraying Jake LaMotta in Scorsese's drama Raging Bull (1980). His other Oscar-nominated roles were for Taxi Driver (1976), The Deer Hunter (1978), Awakenings (1990), Cape Fear (1991), and Silver Linings Playbook (2012). Other notable roles include in 1900 (1976), The King of Comedy (1982), Once Upon a Time in America (1984), Brazil (1985), The Mission (1986), Goodfellas (1990), This Boy's Life (1993), Mary Shelley’s Frankenstein (1994), Heat (1995), Casino (1995), Jackie Brown (1997), The Good Shepherd (2006), Joker (2019), and The Irishman (2019). He made his directorial film debut with A Bronx Tale (1993). His comedic roles include Midnight Run (1988), Wag the Dog (1997), Analyze This (1999), the Meet the Parents films (2000-2010), and The Intern (2015). Also known for his television roles, De Niro portrayed Bernie Madoff in the HBO film The Wizard of Lies (2017), earning a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination. He received further Emmy Award nominations for producing the Netflix limited series When They See Us (2019), and for portraying Robert Mueller on Saturday Night Live.[1] De Niro and producer Jane Rosenthal founded the film and television production company TriBeCa Productions in 1989, which has produced several films alongside his own. Also with Rosenthal, he founded the Tribeca Film Festival in 2002. Six of De Niro's films have been inducted into the United States National Film Registry by the Library of Congress as 'culturally, historically, or aesthetically significant'.",
        "profile_path": "https://image.tmdb.org/t/p/w500/cT8htcckIuyI1Lqwt1CvD02ynTh.jpg",
        "filmography": [
            "Brazil (1985)",
            "Taxi Driver (1976)",
            "The Untouchables (1987)",
            "Jackie Brown (1997)",
            "Mean Streets (1973)"
        ]
    },
    {
        "id": 3096,
        "name": "John Cazale",
        "biography": "John Holland Cazale (August 12, 1935 - March 12, 1978) was an American actor. He appeared in five films during six years, each one nominated for the Academy Award for Best Picture: The Godfather, The Conversation, The Godfather Part II, Dog Day Afternoon, and The Deer Hunter. He appeared in archival footage in The Godfather Part III, also nominated for Best Picture, making him the only actor to have this multi-film distinction. From his start as a theater actor, he became one of Hollywood's premier character actors, starting with his role as the doomed, weak-minded Fredo Corleone opposite longtime friend Al Pacino in Francis Ford Coppola's film The Godfather and its 1974 sequel.",
        "profile_path": "https://image.tmdb.org/t/p/w500/41wXX1FBalyIuf5eaA4S43Y8IfZ.jpg",
        "filmography": [
            "The Godfather Part II (1974)",
            "Dog Day Afternoon (1975)",
            "The Conversation (1974)",
            "The Deer Hunter (1978)",
            "The Godfather 1901–1959: The Complete Epic (1981)"
        ]
    },
    {
        "id": 3896,
        "name": "Liam Neeson",
        "biography": "He was born in Ballymena, County Antrim, Northern Ireland and educated at Saint Patrick's College, Ballymena Technical College and Queen's University Belfast. He moved to Dublin after university to further his acting career, joining the renowned Abbey Theatre. In the early 1990s, he moved again to the United States, where the wide acclaim for his performance in Schindler's List led to more high-profile work. He is widowed and lives in New York with his two sons. An Irish actor who has been nominated for an Oscar, a BAFTA and three Golden Globe Awards. He has starred in a number of notable roles including Oskar Schindler in Schindler's List, Michael Collins in Michael Collins, Peyton Westlake in Darkman, Jean Valjean in Les Misérables, Qui-Gon Jinn in Star Wars Episode I: The Phantom Menace, Alfred Kinsey in Kinsey, Ras Al Ghul in Batman Begins and the voice of Aslan in The Chronicles of Narnia film series. He has also starred in several other notable films, from major Hollywood studio releases (ie. Excalibur, The Dead Pool, Nell, Rob Roy, The Haunting, Love Actually, Kingdom of Heaven, Taken, Clash of the Titans, The A-Team, Unknown) to smaller arthouse films (ie. Deception, Breakfast on Pluto, Chloe). Description from the Wikipedia article Liam Neeson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/bboldwqSC6tdw2iL6631c98l2Mn.jpg",
        "filmography": [
            "Batman Begins (2005)",
            "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005)",
            "Schindler's List (1993)",
            "Love Actually (2003)",
            "Breakfast on Pluto (2005)"
        ]
    },
    {
        "id": 2282,
        "name": "Ben Kingsley",
        "biography": "Sir Ben Kingsley (born Krishna Pandit Bhanji; December 31, 1943) is an English actor. He has received various accolades throughout his career spanning five decades, including an Academy Award, a British Academy Film Award, a Grammy Award, and two Golden Globe Awards. Kingsley was appointed Knight Bachelor in 2002 for services to the British film industry. In 2010, he was awarded a star on the Hollywood Walk of Fame. In 2013, he received the Britannia Award for Worldwide Contribution to Filmed Entertainment. Description above from the Wikipedia article Ben Kingsley, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/vQtBqpF2HDdzbfXHDzR4u37i1Ac.jpg",
        "filmography": [
            "Lucky Number Slevin (2006)",
            "Oliver Twist (2005)",
            "Schindler's List (1993)",
            "A.I. Artificial Intelligence (2001)",
            "Gandhi (1982)"
        ]
    },
    {
        "id": 5469,
        "name": "Ralph Fiennes",
        "biography": "Ralph Nathaniel Twisleton-Wykeham-Fiennes (born December 22, 1962) is an English actor, film producer, and director. Since 1999, Fiennes has served as an ambassador for UNICEF UK. A Shakespeare interpreter, he first achieved success onstage at the Royal National Theatre. He made his film debut playing Heathcliff in Emily Brontë's Wuthering Heights. A noted Shakespeare interpreter, he first achieved success onstage at the Royal National Theatre. Fiennes' portrayal of Nazi war criminal Amon Göth in Schindler's List (1993) earned him nominations for the Academy Award for Best Supporting Actor and the Golden Globe Award for Best Supporting Actor, and he won the BAFTA Award for Best Actor in a Supporting Role. His performance as Count Almásy in The English Patient (1996) garnered him a second Academy Award nomination, for Best Actor, as well as BAFTA and Golden Globe nominations. Since then, Fiennes has been in a number of notable films, including Quiz Show (1994), Strange Days (1995), The End of the Affair (1999), Red Dragon (2002), The Constant Gardener (2005), In Bruges (2008), The Reader (2008), Clash of the Titans (2010), Great Expectations (2012), and The Grand Budapest Hotel (2014). He voiced Rameses in The Prince of Egypt (1998). Fiennes is most known for his role in the major film franchise series of Harry Potter films (2005–2011), in which he played the main villain, Lord Voldemort. In the James Bond series he played Gareth Mallory / M, starting with the 2012 film Skyfall. In 2011, Fiennes made his directorial debut with his film adaptation of Shakespeare's tragedy Coriolanus, in which he also played the title character. Fiennes won a Tony Award for playing Prince Hamlet on Broadway.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tJr9GcmGNHhLVVEH3i7QYbj6hBi.jpg",
        "filmography": [
            "Strange Days (1995)",
            "The English Patient (1996)",
            "Schindler's List (1993)",
            "Wallace & Gromit: The Curse of the Were-Rabbit (2005)",
            "Harry Potter and the Order of the Phoenix (2007)"
        ]
    },
    {
        "id": 6692,
        "name": "Caroline Goodall",
        "biography": "Caroline Cruice Goodall (born November 13, 1959) is a British actress and screenwriter. She was nominated for AFI Awards for her roles in the 1989 miniseries Cassidy, and the 1995 film Hotel Sorrento. Her other film appearances include Hook (1991), Cliffhanger (1993), Schindler's List (1993), Disclosure (1994), White Squall (1996), The Princess Diaries (2001) and The Best of Me (2014).",
        "profile_path": "https://image.tmdb.org/t/p/w500/4cagGtMqACvkuw6Llq8Li8UJ1AR.jpg",
        "filmography": [
            "Hook (1991)",
            "Schindler's List (1993)",
            "Birds of Paradise (2021)",
            "White Squall (1996)",
            "My Life in Ruins (2009)"
        ]
    },
    {
        "id": 6693,
        "name": "Jonathan Sagall",
        "biography": "From Wikipedia, the free encyclopedia Jonathan Sagall (born April 23, 1959) is an Israeli actor, film director, TV director and screenwriter. Description above from the Wikipedia article Jonathan Sagall, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/waxNDsgfw7CXXO3LH8EdKi8z7VV.jpg",
        "filmography": [
            "Schindler's List (1993)",
            "Lemon Popsicle (1978)",
            "Going Steady (1979)",
            "Hot Bubblegum (1981)",
            "Private Popsicle (1982)"
        ]
    },
    {
        "id": 1936,
        "name": "Martin Balsam",
        "biography": "Martin Henry Balsam (November 4, 1919 – February 13, 1996) was an American character actor. He is best known for a number of film roles, including detective Milton Arbogast in Alfred Hitchcock's Psycho (1960), Arnold Burns in A Thousand Clowns (1965), which earned him the Academy Award for Best Supporting Actor, Juror #1 in 12 Angry Men (1957), and Mr. Green in The Taking of Pelham One Two Three (1974), as well as for his role as Murray Klein in the television sitcom Archie Bunker's Place (1979–1983).",
        "profile_path": "https://image.tmdb.org/t/p/w500/2j4LJJfTPQtvnjp8LfSGOvWFATO.jpg",
        "filmography": [
            "Breakfast at Tiffany's (1961)",
            "All the President's Men (1976)",
            "Psycho (1960)",
            "The Brother from Space (1988)",
            "Catch-22 (1970)"
        ]
    },
    {
        "id": 5247,
        "name": "John Fiedler",
        "biography": "John Donald Fielder (February 3, 1925 - June 25, 2005) was an American actor. The son of an Irish-German beer salesman, Fiedler knew he wanted to be an actor from the childhood days when he had a full head of reddish-yellow hair. He made his first professional appearances on stage, branched out into live TV in New York and, then, during the 20 years he lived in Hollywood (1960-80), turned up in many films and an ever greater number of popular TV series. His career lasted more than 55 years in stage, film, television, and radio.",
        "profile_path": "https://image.tmdb.org/t/p/w500/6vfLLGeGuO6Ko0VRnyhgE2v6RUu.jpg",
        "filmography": [
            "The Fox and the Hound (1981)",
            "The Odd Couple (1968)",
            "Mickey's House of Villains (2001)",
            "Robin Hood (1973)",
            "Winnie the Pooh and a Day for Eeyore (1983)"
        ]
    },
    {
        "id": 5249,
        "name": "E.G. Marshall",
        "biography": "E. G. Marshall (June 18, 1914 – August 24, 1998) was an American actor, best known for his television roles as the lawyer Lawrence Preston on The Defenders in the 1960s, and as neurosurgeon David Craig on The Bold Ones: The New Doctors in the 1970s. Among his film roles, he is perhaps best known as the unflappable Juror #4 in Sidney Lumet's courtroom drama 12 Angry Men (1957).​From Wikipedia, the free encyclopedia",
        "profile_path": "https://image.tmdb.org/t/p/w500/psimeVoRk64DV7UNm4cLQylRFy2.jpg",
        "filmography": [
            "Absolute Power (1997)",
            "The Caine Mutiny (1954)",
            "Is Paris Burning? (1966)",
            "Nixon (1995)",
            "The Buccaneer (1958)"
        ]
    },
    {
        "id": 5248,
        "name": "Lee J. Cobb",
        "biography": "Lee J. Cobb (December 8, 1911 - February 11, 1976) ) was an American actor best known for his performance in 12 Angry Men (1957), his Academy Award-nominated performance in On the Waterfront, and one of his last films, The Exorcist (1973). He also played the role of Willy Loman in the original Broadway production of Arthur Miller's 1949 play Death of a Salesman under the direction of Elia Kazan. On television, Cobb costarred in the first four seasons of the popular, long-running western series The Virginian. He typically played arrogant, intimidating, and abrasive characters, but often had roles as respectable figures such as judges. Born Leo Jacob in New York City, he grew up in The Bronx,  before studying at New York University and making his film debut in The Vanishing Shadow (1934).  Cobb performed in numerous theater productions and companies, including Group Theatre (New York) before serving in the First Motion Picture Unit of the Army Air Force during World War II.   Following the war, Cobb returned to film, television and theater before being accused of being a Communist in 1951 testimony before the House Un-American Activities Committee by Larry Parks, himself a former Communist Party member. Cobb was called to testify before HUAC but refused to do so for two years until, with his career threatened by the blacklist, he relented in 1953 and gave testimony in which he named 20 people as former members of the Communist Party USA. Following the hearing he resumed his career and worked with Elia Kazan and Budd Schulberg, two other HUAC 'friendly witnesses', on the 1954 film On the Waterfront, which is widely seen as an allegory and apologia for testifying.  His 1968 performance as King Lear achieved the longest run (72 performances) for the play in Broadway history.  One of his final film roles was that of police detective Lt. Kinderman in the 1973 horror film The Exorcist. Cobb died of a heart attack in February 1976 in Woodland Hills, California, and was buried in Mount Sinai Memorial Park Cemetery in Los Angeles. He was survived by his second wife, Mary Hirsch, and daughter, also an accomplished actress, Julie Cobb.",
        "profile_path": "https://image.tmdb.org/t/p/w500/dMpk9Xd3BqGOGHyOA1wQCcF8v1I.jpg",
        "filmography": [
            "On the Waterfront (1954)",
            "Exodus (1960)",
            "Thieves' Highway (1949)",
            "Sirocco (1951)",
            "In Like Flint (1967)"
        ]
    },
    {
        "id": 5250,
        "name": "Jack Klugman",
        "biography": "As a film character actor, Klugman was the epitome of the everyman. He was one of the pioneers of television acting in the 1950s, and is best remembered for his 1970s TV work as Oscar Madison on 'The Odd Couple' (1970) and as the medical examiner on 'Quincy M.E.' (1976).",
        "profile_path": "https://image.tmdb.org/t/p/w500/oJxveOxlunD8C9OczqKeryU0k6D.jpg",
        "filmography": [
            "Rod Serling: Submitted for Your Approval (1995)",
            "Cry Terror! (1958)",
            "Two-Minute Warning (1976)",
            "The Split (1968)",
            "Days of Wine and Roses (1963)"
        ]
    },
    {
        "id": 19587,
        "name": "Rumi Hiiragi",
        "biography": "Rumi Hiiragi (born August 1, 1987 in Tokyo) is a Japanese actress. Description above from the Wikipedia article Rumi Hiiragi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/zITaVtFyc4xSM3mxSoPRWHbqgJI.jpg",
        "filmography": [
            "Spirited Away (2001)",
            "Ruined (2021)",
            "Ponyo (2008)",
            "From Up on Poppy Hill (2011)",
            "Bayside Shakedown The Final: The New Hope (2012)"
        ]
    },
    {
        "id": 19588,
        "name": "Miyu Irino",
        "biography": "Miyu Irino is a Japanese actor and voice actor from Tokyo. He voices the lead character Sora in the Kingdom Hearts video game series. His major anime voice roles include Todomatsu Matsuno in Osomatsu-san, Haku in Spirited Away, Daisuke Niwa in D.N.Angel, Syaoran Li in Tsubasa Reservoir Chronicle, Sena Kobayakawa in Eyeshield 21, Astral in Yu-Gi-Oh! Zexal, Jintan in Anohana: The Flower We Saw That Day, Yuichiro Hyakuya in Seraph of the End, and Ishida Shouya in A Silent Voice. On June 26, 2009, he released his debut mini-album called Soleil, and in August 2009, Irino played a leading role in the movie Monochrome Girl. His first single album, Faith, was released on November 25, 2009.",
        "profile_path": "https://image.tmdb.org/t/p/w500/8qEEhHUObNvGQr4e6eqLu5z4qTz.jpg",
        "filmography": [
            "Spirited Away (2001)",
            "Osomatsu-san VR (2018)",
            "Five Numbers! (2011)",
            "TIGER & BUNNY: The Beginning (2012)",
            "ANOHANA FES. (2011)"
        ]
    },
    {
        "id": 19589,
        "name": "Mari Natsuki",
        "biography": "Junko Nakajima (中島 淳子 Nakajima Junko, born 2 May 1952), more commonly known by her stage name Mari Natsuki (夏木 マリ Natsuki Mari), is a Japanese singer, dancer and actress. Born in Tokyo, she started work as a singer from a young age. In 2007 she announced her engagement to percussionist Nobu Saitō, with their marriage taking place in Spring 2008.",
        "profile_path": "https://image.tmdb.org/t/p/w500/aRs3dGqA2bCuGSZ7lJGhQKe8rhp.jpg",
        "filmography": [
            "Spirited Away (2001)",
            "Samurai Fiction (1998)",
            "The Brand New Legend of the Stardust Brothers (2018)",
            "Ping Pong (2002)",
            "The Hunted (1995)"
        ]
    },
    {
        "id": 19590,
        "name": "Takashi Naito",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/zfs63NZKNG3Uy6WqqXSQWYMQXKZ.jpg",
        "filmography": [
            "Spirited Away (2001)",
            "Cat Taxi (2010)",
            "A Legend of Turmoil (1992)",
            "Baton (2009)",
            "Baton (2009)"
        ]
    },
    {
        "id": 19591,
        "name": "Yasuko Sawaguchi",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/rWspusb13VeJowmctnniXYYTcqq.jpg",
        "filmography": [
            "Spirited Away (2001)",
            "Godzilla 1985 (1985)",
            "Godzilla vs. Biollante (1989)",
            "Princess from the Moon (1987)",
            "Orochi, the Eight-Headed Dragon (1994)"
        ]
    },
    {
        "id": 55061,
        "name": "Kajol",
        "biography": "Kajol (born Kajol Mukherjee, 5 August 1974), also known by her married name Kajol Devgan, is an Indian film actress, who predominantly works in Hindi cinema. Born in Mumbai to the Mukherjee-Samarth family, she is the daughter of actress Tanuja Samarth and late filmmaker Shomu Mukherjee. Regarded as one of India's most successful and highest-paid actresses, Kajol is the recipient of numerous accolades, including six Filmfare Awards, among twelve nominations. Along with her late aunt Nutan, she holds the record for most Best Actress wins at Filmfare, with five. In 2011, the Government of India awarded her with the Padma Shri, the fourth highest civilian honour of the country. After making her acting debut in the 1992 romance Bekhudi, with her mother Kajol had her first commercial success with the 1993 thriller Baazigar. She rose to prominence by featuring as the female lead in five of India's annually top-grossing romances—Yeh Dillagi (1994), Ishq (1997), Pyaar Kiya To Darna Kya (1998), Pyaar To Hona Hi Tha (1998) and Hum Aapke Dil Mein Rehte Hain (1999)—and received wide critical recognition for playing against type in the 1997 mystery film Gupt: The Hidden Truth, that earned her a Filmfare Award for Best Villain, and the 1998 psychological thriller Dushman. Her acclaimed portrayal of a conservative NRI in the blockbuster romance Dilwale Dulhania Le Jayenge (1995), a tomboy in the blockbuster romance Kuch Kuch Hota Hai (1998), a lower middle class Punjabi woman in the blockbuster melodrama Kabhi Khushi Kabhie Gham... (2001), a blind Kashmiri woman in the romantic thriller Fanaa (2006) and a divorced, single mother in the drama My Name Is Khan (2010) garnered her five Filmfare Awards for Best Actress. Following a five-year sabbatical from full-time acting in 2001, Kajol received praise for portraying the lead female roles in the dramas U Me Aur Hum (2008) and We Are Family (2010), and the comedy Dilwale (2015). In addition to acting in films, Kajol is a social activist and is noted for her work with widows and children, for which she received the Karmaveer Puraskaar in 2008. She has featured as a talent judge for Zee TV's reality show Rock-N-Roll Family and holds a managerial position at Devgn Entertainment and Software Ltd. Kajol has been married to actor Ajay Devgn since 1999, with whom she has two children.",
        "profile_path": "https://image.tmdb.org/t/p/w500/h4m0TkDuEMCUNaPrQxMRyFb2AQ7.jpg",
        "filmography": [
            "Kabhi Khushi Kabhie Gham (2001)",
            "Salaam Venky (2022)",
            "U Me Aur Hum (2008)",
            "Kuch Kuch Hota Hai (1998)",
            "Fanaa (2006)"
        ]
    },
    {
        "id": 35742,
        "name": "Shah Rukh Khan",
        "biography": "Shah Rukh Khan (born November 2, 1965) is an Indian actor and producer who works in Hindi cinema. He made his film debut in Deewana (1992). Since then, he has appeared in more than 100 films, and earned numerous accolades, including 14 Filmfare Awards. Khan has a significant following in Asia and the Indian diaspora worldwide. In terms of audience size and income, several media outlets have described him as one of the most successful film stars in the world. He holds many records, including highest grossing Indian actor in a single year.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tCEppfUu0g2Luu0rS5VKMoL4eSw.jpg",
        "filmography": [
            "Jawan (2023)",
            "Kabhi Khushi Kabhie Gham (2001)",
            "Heyy Babyy (2007)",
            "Veer-Zaara (2004)",
            "Chalte Chalte (2003)"
        ]
    },
    {
        "id": 691,
        "name": "Amrish Puri",
        "biography": "From Wikipedia, the free encyclopedia. Amrish Lal Puri (June 22, 1932 - January 12, 2005) was an iconic theater and film actor from India, who was a key player in the Indian theater movement that picked up steam in the 1960s. He worked with notable playwrights of the time, such as Satyadev Dubey and Girish Karnad. However, he is primarily remembered for essaying some iconic negative roles in Hindi cinema. He is most remembered for his role as Mogambo in the Hindi film Mr India (1987). As Mola Ram in the Hollywood film Indiana Jones and the Temple of Doom (1984), he crossed over to international cinema as well. Description above from the Wikipedia article Amrish Puri, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/uhMGFS7tuG71LDv2wk9LfZZ4EG6.jpg",
        "filmography": [
            "Indiana Jones and the Temple of Doom (1984)",
            "Gandhi (1982)",
            "Hulchul (2004)",
            "Taal (1999)",
            "Mujhse Shaadi Karogi (2004)"
        ]
    },
    {
        "id": 146971,
        "name": "Farida Jalal",
        "biography": "Farida Jalal (born 14 March 1949) is an Indian actress. In a film career spanning almost fifty years, Jalal acted in over 200 films in the Hindi, the Telugu, and the Tamil film industries. Best known for her character driven roles in independent cinema and supporting work in mainstream Bollywood productions, Jalal has received such accolades as four Filmfare Awards and two Bengal Film Journalists Association Awards. Jalal started her career with Taqdeer (1967). She went on to play leading and supporting roles in numerous motion pictures through the 1970s and early 80s. She is widely remembered for her roles in Paras (1971), Henna (1991) and Dilwale Dulhania Le Jayenge (1995), all of which garnered the Filmfare Award for Best Supporting Actress. She became a household name after portraying motherly roles and strong female characters in the 1990s and the early 2000s. She has also won the Filmfare Critics Award for Best Performance for her role in Mammo (1994). She won the Best Actress Award at the 2012 Harlem International Film Festival for her role in A Gran Plan (2012). She has successfully transitioned to numerous shows on Indian television alongside her work in films. Some of her notable works are the sitcom Yeh Jo Hai Zindagi, Dekh Bhai Dekh, Shararat and Ammaji Ki Galli. She was seen in the soap opera Satrangi Sasural on channel Zee TV portraying the role of Gomti Vatsal a.k.a. Dadi Maa.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tJdqL4BRSAWVFX1W6cmwxFs9IFh.jpg",
        "filmography": [
            "Shaadi, Dahej and Gangster (2021)",
            "Kabhi Khushi Kabhie Gham (2001)",
            "Bobby (1973)",
            "The Legend of Bhagat Singh (2002)",
            "Shastra (1996)"
        ]
    },
    {
        "id": 6217,
        "name": "Anupam Kher",
        "biography": "Anupam Kher (born March 7, 1955) is an Indian actor, director and producer who works primarily in Hindi-language films. He has appeared in nearly 400 films and 100 plays. He has played a variety of characters including numerous critically acclaimed leading or parallel roles. The Government of India honoured him with the Padma Shri in 2004 and the Padma Bhushan in 2016 for his contribution in the field of Indian cinema and arts. Kher is known internationally for Bend It Like Beckham (2002), Bride and Prejudice (2004) and The Mistress of Spices (2005). In 2012, he co-starred in the Academy Award-winning Silver Linings Playbook.",
        "profile_path": "https://image.tmdb.org/t/p/w500/f7hWJ4tvzR7uXmYoTiB41TpQ2NZ.jpg",
        "filmography": [
            "Bend It Like Beckham (2002)",
            "Main Tera Dushman (1989)",
            "Heyy Babyy (2007)",
            "Veer-Zaara (2004)",
            "Sankat City (2009)"
        ]
    },
    {
        "id": 3894,
        "name": "Christian Bale",
        "biography": "Christian Charles Philip Bale (born 30 January 1974) is an English actor. Known for his versatility and physical transformations for his roles, he has been a leading man in films of several genres. He has received various accolades, including an Academy Award and two Golden Globe Awards. Forbes magazine ranked him as one of the highest-paid actors in 2014. Born in Wales to English parents, Bale had his breakthrough role at age 13 in Steven Spielberg's 1987 war film Empire of the Sun. After more than a decade of performing in leading and supporting roles in films, he gained wider recognition for his portrayals of serial killer Patrick Bateman in the black comedy American Psycho (2000) and the titular role in the psychological thriller The Machinist (2004). In 2005, he played superhero Batman in Batman Begins and again in The Dark Knight (2008) and The Dark Knight Rises (2012), garnering acclaim for his performance in the trilogy, which is one of the highest-grossing film franchises. Bale continued in starring roles in a range of films outside his work as Batman, including the period drama The Prestige (2006), the action film Terminator Salvation (2009), the crime drama Public Enemies (2009), the epic film Exodus: Gods and Kings (2014) and the superhero film Thor: Love and Thunder (2022). For his portrayal of boxer Dicky Eklund in the 2010 biographical film The Fighter, he won an Academy Award and a Golden Globe Award. Further Academy Award and Golden Globe Award nominations came for his work in the black comedy American Hustle (2013) and the biographical dramedies The Big Short (2015) and Vice (2018). His performances as politician Dick Cheney in Vice and race car driver Ken Miles in the sports drama Ford v Ferrari (2019) earned him a second win and a fifth nomination respectively at the Golden Globe Awards.",
        "profile_path": "https://image.tmdb.org/t/p/w500/7Pxez9J8fuPd2Mn9kex13YALrCQ.jpg",
        "filmography": [
            "The Dark Knight (2008)",
            "Batman Begins (2005)",
            "Shaft (2000)",
            "Terminator Salvation (2009)",
            "The Prestige (2006)"
        ]
    },
    {
        "id": 31,
        "name": "Tom Hanks",
        "biography": "Thomas Jeffrey Hanks (born July 9, 1956) is an American actor and filmmaker. Known for both his comedic and dramatic roles, Hanks is one of the most popular and recognizable film stars worldwide, and is widely regarded as an American cultural icon. Hanks made his breakthrough with leading roles in the comedies Splash (1984) and Big (1988). He won two consecutive Academy Awards for Best Actor for starring as a gay lawyer suffering from AIDS in Philadelphia (1993) and a young man with below-average IQ in Forrest Gump (1994). Hanks collaborated with film director Steven Spielberg on five films: Saving Private Ryan (1998), Catch Me If You Can (2002), The Terminal (2004), Bridge of Spies (2015), and The Post (2017), as well as the 2001 miniseries Band of Brothers, which launched him as a director, producer, and screenwriter. Hanks' other notable films include the romantic comedies Sleepless in Seattle (1993) and You've Got Mail (1998); the dramas Apollo 13 (1995), The Green Mile (1999), Cast Away (2000), Road to Perdition (2002), and Cloud Atlas (2012); and the biographical dramas Saving Mr. Banks (2013), Captain Phillips (2013), Sully (2016), and A Beautiful Day in the Neighborhood (2019). He has also appeared as the title character in the Robert Langdon film series, and has voiced Sheriff Woody in the Toy Story film series. Description above from the Wikipedia article Tom Hanks, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/oFvZoKI6lvU03n4YoNGAll9rkas.jpg",
        "filmography": [
            "Forrest Gump (1994)",
            "The Simpsons Movie (2007)",
            "Saving Private Ryan (1998)",
            "Sleepless in Seattle (1993)",
            "Toy Story (1995)"
        ]
    },
    {
        "id": 52,
        "name": "David Morse",
        "biography": "David Bowditch Morse (born October 11, 1953) is an American stage, television, and film actor. He first came to national attention as Dr. Jack Morrison in the medical drama St. Elsewhere from 1982 to 1988. Morse continued his movie career with roles in Dancer in the Dark, The Negotiator, The Green Mile, Disturbia, The Long Kiss Goodnight, The Crossing Guard, The Rock, Extreme Measures, Twelve Monkeys, 16 Blocks, and Hounddog. In 2006, Morse had a recurring role as Detective Michael Tritter on the medical drama House for which he received an Emmy Award nomination.  Morse portrayed George Washington in the 2008 HBO Miniseries John Adams, which garnered him a second Emmy nomination. Morse has received acclaim for his portrayal of Uncle Peck on the Off-Broadway play How I Learned to Drive for which he earned a Drama Desk and Obie Award. He also had success on Broadway, portraying James 'Sharky' Harkin in The Seafarer. As of 2011, Morse is a regular on the HBO series, 'Treme'.​From Wikipedia, the free encyclopedia",
        "profile_path": "https://image.tmdb.org/t/p/w500/A6zGbkFjM3uajIakgsSeNTmSKqY.jpg",
        "filmography": [
            "Dancer in the Dark (2000)",
            "Twelve Monkeys (1995)",
            "The Green Mile (1999)",
            "The Getaway (1994)",
            "Contact (1997)"
        ]
    },
    {
        "id": 5149,
        "name": "Bonnie Hunt",
        "biography": "Bonnie Lynne Hunt (born September 22, 1961) is an American actress, comedian, writer, director, television producer and daytime television host.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tT9C6uLztgN8OxJULq6F9iEzqlA.jpg",
        "filmography": [
            "Rain Man (1988)",
            "Cars (2006)",
            "The Green Mile (1999)",
            "Monsters, Inc. (2001)",
            "Toy Story 3 (2010)"
        ]
    },
    {
        "id": 61981,
        "name": "Michael Clarke Duncan",
        "biography": "Michael Clarke Duncan (December 12, 1957 - September 3, 2012) was an American film and television actor, best known for his breakout role as John Coffey in the feature film The Green Mile, which netted him an Academy Award nomination for Best Actor in a Supporting Role and a Golden Globe nomination for Best Performance by an Actor in a Supporting Role in a Motion Picture.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3RX8OBqt3gbvFwKYZqiom4O3Ta6.jpg",
        "filmography": [
            "Armageddon (1998)",
            "Sin City (2005)",
            "Planet of the Apes (2001)",
            "The Green Mile (1999)",
            "D.E.B.S. (2005)"
        ]
    },
    {
        "id": 2505,
        "name": "James Cromwell",
        "biography": "James Oliver Cromwell (born 27 January 1940) is an American film and television actor, probably best known for his role as Dr. Zefram Cochrane in Star Trek: First Contact. He has been nominated for an Oscar, three Emmy Awards, and four Screen Actors Guild Awards during his career. Cromwell was born in Los Angeles, California and was raised in Manhattan, New York. He was adopted by actress Kay Johnson and actor, director and producer John Cromwell, who was blacklisted during the McCarthy era. He was educated at The Hill School, Middlebury College and Carnegie Institute of Technology (now Carnegie Mellon University), where he studied engineering. Like both his parents, he was drawn to the theater, doing everything from Shakespeare to experimental plays. He has long been an advocate of leftist causes. In an October 2008 interview, he strongly attacked the Republican Party and the George W. Bush administration, saying their controversial foreign policy would 'either destroy us or the entire planet.' He became a vegetarian in 1974 after seeing a stockyard in Texas and experiencing the 'smell, terror and anxiety.' He became an ethical vegan while playing the character of Farmer Hoggett in the movie Babe in 1995. He frequently speaks out on issues regarding animal cruelty for PETA, largely the treatment of pigs. Cromwell was married to Anne Ulvestad from 1976 to 1986. They had three children. He married his second wife, Julie Cobb, on 29 May 1986.",
        "profile_path": "https://image.tmdb.org/t/p/w500/vpNQQbM5PtxsYmVm4oh79SGFyUK.jpg",
        "filmography": [
            "Star Trek: First Contact (1996)",
            "The Green Mile (1999)",
            "The Queen (2006)",
            "Spider-Man 3 (2007)",
            "I, Robot (2004)"
        ]
    },
    {
        "id": 3967,
        "name": "Kate Beckinsale",
        "biography": "Kathrin Romany Beckinsale (born 26 July 1973) is an English actress and model.. She first gained notice, while a student at Oxford University, for making her debut in the film adaptation of Shakespeare's Much Ado About Nothing. Throughout the 1990s, she worked on both film and television, most notably by portraying the title character in the 1996 BBC television series Emma. She started film work in the United States in the late 1990s. She appeared in small-scale dramas The Last Days of Disco (1998) and Brokedown Palace (1999). In 2001, she garnered international recognition when she was cast as the romantic lead opposite Ben Affleck in her breakthrough film, Pearl Harbor (2001). She then starred in a number of films including the romantic comedy Serendipity (2001), Tiptoes (2003), The Aviator (2004), and Click (2006). Since playing the role of Selene in the Underworld film series (2003–2016), she has become known for her work in action films, including Van Helsing (2004), Whiteout (2009), Contraband (2012), and Total Recall (2012). In 2016, she received critical acclaim for her performance in the period comedy film Love & Friendship, for which she received a nomination for the Critics' Choice Movie Award for Best Actress in a Comedy. She returned in action films with Jolt (2021). She also starred in two television projects with The Widow (2019) and Guilty Party (2021).",
        "profile_path": "https://image.tmdb.org/t/p/w500/9RnPZhX9PXaHL4PFE65RUQLSewt.jpg",
        "filmography": [
            "Underworld (2003)",
            "Pearl Harbor (2001)",
            "Underworld: Evolution (2006)",
            "Vacancy (2007)",
            "The Aviator (2004)"
        ]
    },
    {
        "id": 36669,
        "name": "Rupert Friend",
        "biography": "Rupert Friend (born October 1, 1981) is an English film actor, who is best known for his roles as Mr. Wickham in the 2005 film Pride and Prejudice, Lieutenant Kurt Kotler in the 2008 film The Boy in the Striped Pajamas, and Prince Albert in the 2009 film The Young Victoria.",
        "profile_path": "https://image.tmdb.org/t/p/w500/mYgY8LrMkQ4OkGTIOf6MtkbMnnW.jpg",
        "filmography": [
            "Pride & Prejudice (2005)",
            "Chéri (2009)",
            "The Libertine (2004)",
            "The Last Legion (2007)",
            "Outlaw (2007)"
        ]
    },
    {
        "id": 9825,
        "name": "Saffron Burrows",
        "biography": "Saffron Dominique Burrows (born 22 October 1972) is an English actress and former fashion model. She starred as Detective Serena Stevens on Law & Order: Criminal Intent.",
        "profile_path": "https://image.tmdb.org/t/p/w500/2qMLZh9XWquBt7TZF9wmDiOtJdm.jpg",
        "filmography": [
            "Frida (2002)",
            "Troy (2004)",
            "Reign Over Me (2007)",
            "Wing Commander (1999)",
            "Gangster No. 1 (2000)"
        ]
    },
    {
        "id": 56614,
        "name": "Ray Stevenson",
        "biography": "Ray Stevenson (May 25, 1964 - May 21, 2023) was a film, TV and stage actor. He moved with his family to Lemington, Newcastle-Upon-Tyne, England in 1972 at the age of eight, and later to Cramlington, Northumberland, where he was raised. The second of three sons of a Royal Air Force pilot father and an Irish mother, As a child he dreamed to become an actor, but he also thought that dream was impossible. So he pursued his other love, art, and went to art school instead. He was an interior designer with an architectural firm in London when he at 25 decided to try out acting. Eventually he attended Bristol Old Vic Theatre School, graduating at the age of 29. At the beginning of 90s, he began his career on films. He did a few TV films, one of them being The Return of the Native (1994), where he appeared opposite Clive Owen, Catherine Zeta-Jones and Steven Mackintosh. He also filmed The Theory of Flight (1998) Greenwich Mean Time (1999), Green-Eyed Monster (2001) (TV) and a lot of TV guest roles in series. Finally, he made a international breakout with King Arthur (2004), as quiet, but loyal knight Dagonet, again with Clive Owen (who played Arthur), Keira Knightley, Ioan Gruffudd, Mads Mikkelsen, Ray Winstone and Stellan Skarsgard. After a few more TV films, Stevenson's popularity stared to rise by each film. But, the real fame comes with HBO's 'Rome' (2005 - 2007), as funny, but heroically fearless legionary Titus Pullo, opposite Kevin McKidd. Another two well-known roles were in action horror Outpost (2008) and as comic book dark hero The Punisher / Frank Castle in extremely violent Punisher: War Zone (2008), opposite Dominic West (Jigsaw), Doug Hutchison, Colin Salmon, Wayne Knight (Microchip), Dash Mihok (Det. Marin Soap) and Julie Benz. To mention that Stevenson also worked on stage. He played the part of Christ in the York Mystery Plays in 2000 at York Minster. In 2001 he took the part of Roger in the play Mouth to Mouth by Kevin Elyot, at the Albery Theatre in London with Lindsay Duncan and Michael Maloney. His most well-known part was perhaps that of the Cardinal in The Duchess of Malfi by John Webster with Janet McTeer at the Royal National Theatre in 2003. Stevenson and his girlfriend Elisabetta Carccia have a son Sebastiano Derek Stevenson, who was born in 2007. Besides acting, he loves art and has a passion for water color painting.",
        "profile_path": "https://image.tmdb.org/t/p/w500/msafbswGI6uisRuNvQ8a1wMF5Ca.jpg",
        "filmography": [
            "Thor (2011)",
            "The Book of Eli (2010)",
            "Wild Child: The Story of Feral Children (2002)",
            "Cirque du Freak: The Vampire's Assistant (2009)",
            "Accident Man: Hitman's Holiday (2022)"
        ]
    },
    {
        "id": 44736,
        "name": "Goran Kostić",
        "biography": "Goran Kostić (born November 18, 1971) is a Serbian actor based in the United Kingdom. In 2007, he played the Polish builder Erek in the BBC soap opera EastEnders. He has also had supporting roles in a number of Hollywood films. He was in Taken (2008), Of Gods and Men (2010), Captifs (2010), and In the Land of Blood and Honey (2011).",
        "profile_path": "https://image.tmdb.org/t/p/w500/m6CEa5UjqhPzLRbUNHku9GpvCmQ.jpg",
        "filmography": [
            "The Hunting Party (2007)",
            "Taken (2008)",
            "L'Aide Au Retour (2009)",
            "Caged (2010)",
            "In the Land of Blood and Honey (2011)"
        ]
    },
    {
        "id": 205976,
        "name": "Kelsey Asbille",
        "biography": "Kelsey Asbille Chow (born September 9, 1991) is an American actress. She is known for her role as Mikayla in the Disney XD sitcom Pair of Kings and as Monica Dutton in Paramount's Yellowstone. From 2005 to 2009, she had a recurring role as Gigi Silveri on the drama One Tree Hill. She portrayed Tracy Stewart in MTV's Teen Wolf from 2015-2016.",
        "profile_path": "https://image.tmdb.org/t/p/w500/8mXqxKaPc6FpAnLeZlPaaUaJHdC.jpg",
        "filmography": [
            "Don't Move (2024)",
            "Run (2013)",
            "The Amazing Spider-Man (2012)",
            "Den Brother (2010)",
            "The Wine of Summer (2013)"
        ]
    },
    {
        "id": 168877,
        "name": "Finn Wittrock",
        "biography": "Finn Wittrock is a film, TV and theater actor best known for his role as Damon Miller on three seasons of 'All My Children'(ABC/Hulu/OWN, 1970-2013). Having grown up in a theater-obsessed family in Massachusetts and Los Angeles, Wittrock began studying acting on his own after high school, and enrolled in the drama program at New York's prestigious Juilliard School. It wasn't long before he began landing guest spots on shows like 'Cold Case' (CBS, 2003-2010), 'ER' (NBC, 1994-2009), and 'CSI: Miami' (CBS, 2002-2012), all while honing his craft by acting in plays in and around New York and Los Angeles. His big break came in 2009 when he was cast as the young Casanova Damon Miller on 'All My Children.' Wittrock appeared as the Miller character for three seasons on the show, before returning to the stage in 2012. This time, however, he would be starring alongside Philip Seymour Hoffman in a Mike Leigh-directed revival of 'Death of a Salesman.' The revival received overwhelmingly positive reviews, with Wittrock receiving much of the praise for his performance as Harold 'Happy' Loman. After the play wrapped up in the spring of 2012, Wittrock returned to screen acting, appearing in a recurring role as Dale in the 1950s period drama 'Masters of Sex' (Showtime 2013- ), as well as supporting roles in the big-budget epic 'Noah' (2014) and 'Winter's Tale' (2014). 2014 was also the year Wittrock appeared in the HBO movie 'The Normal Heart,' as well as an episode of 'American Horror Story' (FX, 2011- ), thus allowing him to work with writer/director/producer Ryan Murphy on two separate projects in the same year.",
        "profile_path": "https://image.tmdb.org/t/p/w500/gwGMGTmli0uBF7eAhhXePWhYNFJ.jpg",
        "filmography": [
            "Drone (2022)",
            "Origin (2023)",
            "Don't Move (2024)",
            "Downtown Owl (2023)",
            "Unbroken (2014)"
        ]
    },
    {
        "id": 1768996,
        "name": "Daniel Francis",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/ltLYFcQHcaS5wdxX085Lhn0vX5v.jpg",
        "filmography": [
            "1768996",
            "Cla'am (2017)"
        ]
    },
    {
        "id": 1791599,
        "name": "Moray Treadwell",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/hmaqML3iwGouEACUzjWDBJN6Sdz.jpg",
        "filmography": [
            "The People We Hate at the Wedding (2022)",
            "Whose Baby? (2004)",
            "Don't Move (2024)",
            "Planespotting (2005)",
            "Wuthering Heights (1998)"
        ]
    },
    {
        "id": 2890151,
        "name": "Dylan Beam",
        "biography": "Dylan Beam is a child actress, known for The Face of Evil (2019), Someone to Carry You (2021) and Pink Plastic Flamingos (2017).",
        "profile_path": "https://image.tmdb.org/t/p/w500/udzwdodFTx4dvfwoyUX4sU5XdNL.jpg",
        "filmography": [
            "Don't Move (2024)",
            "Pink Plastic Flamingos (2018)"
        ]
    },
    {
        "id": 145121,
        "name": "Pierre Niney",
        "biography": "Pierre Niney (born 13 March 1989) is a French actor. He made his acting debut in the two-part television miniseries La dame d'Izieu in 2007, followed by films such as LOL (Laughing Out Loud), The Army of Crime, Romantics Anonymous and Comme des frères. In October 2010, at age 21, he became the youngest member of the Comédie-Française. In 2014, Niney starred as fashion designer Yves Saint Laurent in the biopic of the same name, for which he won a César Award for Best Actor. His family is of Sephardic Jewish (Egyptian-Jewish) and Catholic background. Source: Article 'Pierre Niney' from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "profile_path": "https://image.tmdb.org/t/p/w500/aMsGsnRPet7pZ2ppAxaRdBz4yGU.jpg",
        "filmography": [
            "Army of Crime (2009)",
            "Goliath (2022)",
            "The Count of Monte-Cristo (2024)",
            "The Book of Solutions (2023)",
            "Masquerade (2022)"
        ]
    },
    {
        "id": 910944,
        "name": "Bastien Bouillon",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/NNaftwlsU8rvBY4e4LX25ZTKgB.jpg",
        "filmography": [
            "So That Nothing Changes (2020)",
            "Off-Season (2023)",
            "The Three of Us (2022)",
            "The Three of Us (2022)",
            "Simone: Woman of the Century (2022)"
        ]
    },
    {
        "id": 123989,
        "name": "Anaïs Demoustier",
        "biography": "Anaïs Aude Marie Michèle Demoustier (born 29 September 1987) is a French actress. Description above from the Wikipedia article Anaïs Demoustier, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/kObYOu3UYkNcQGg1gnl4xitwhNc.jpg",
        "filmography": [
            "Ernest Hemingway: 4 Weddings and a Funeral (2021)",
            "Smoking Causes Coughing (2022)",
            "A comme Azur (2020)",
            "The Price to Pay (2007)",
            "Give Me Your Hand (2008)"
        ]
    },
    {
        "id": 1021689,
        "name": "Anamaria Vartolomei",
        "biography": "Anamaria Vartolomei (born 9 April 1999) is a French-Romanian actress. She began her career as a child actress in the film My Little Princess (2011). She won the Lumières Award for Best Actress and the César Award for Most Promising Actress for her performance in Happening (2021). She appeared on the UniFrance and Screen International list of rising French talents to watch. Vartolomei was born in Bacău and lived in the Plopu village of Dărmănești. Her parents began working abroad when Vartolomei was as young as two, first in England and later France. Having been being cared for by her grandparents in the meantime, she joined her parents at the age of six, settling in Issy-les-Moulineaux. She attended l'école Anatole France. She trained in acting at the Cours Florent and Les Enfants Terribles. She was admitted to the Sorbonne, but opted not to go in favour of her acting career. Source: Article 'Anamaria Vartolomei' from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "profile_path": "https://image.tmdb.org/t/p/w500/u2LZZgiXkUnB1zdauW6qidWLVuP.jpg",
        "filmography": [
            "Medusa (2022)",
            "My Little Princess (2011)",
            "The Count of Monte-Cristo (2024)",
            "The Empire (2024)",
            "Being Maria (2024)"
        ]
    },
    {
        "id": 93532,
        "name": "Laurent Lafitte",
        "biography": "Laurent Lafitte (born 22 August 1973) is a French actor, best known for playing the role of Patrick in Elle. In March 2016, he was named as the host of the opening and closing ceremonies at the 2016 Cannes Film Festival.",
        "profile_path": "https://image.tmdb.org/t/p/w500/lpF5sb1aEMEmxxfZT3u8PWGEipC.jpg",
        "filmography": [
            "La Terre vue de l’espace (2020)",
            "Narco (2004)",
            "Whatever You Say (2002)",
            "Little Nicholas: Happy As Can Be (2022)",
            "Meet the Barbarians (2024)"
        ]
    },
    {
        "id": 7626,
        "name": "Avi Arad",
        "biography": "Avi Arad is an Israeli-American businessman. He became the CEO of the company Toy Biz in the 1990s, and soon afterward became the chief creative officer of Marvel Entertainment, a Marvel director, and the chairman, CEO, and founder of Marvel Studios.",
        "profile_path": "https://image.tmdb.org/t/p/w500/cxmqw0anGfxC7RwUNQj3EwhX9pP.jpg",
        "filmography": [
            "Spider-Man: All Roads Lead to No Way Home (2022)",
            "Metal Gear Solid: Legacy (2015)",
            "X-Men: The Mutant Watch (2000)",
            "Starz Inside: Comic Books Unbound (2008)",
            "Beyond Hell's Kitchen - Making Daredevil (2003)"
        ]
    },
    {
        "id": 1847451,
        "name": "Jeff Hermann",
        "biography": "",
        "profile_path": "",
        "filmography": [
            "Ouch (1990)"
        ]
    },
    {
        "id": 1805438,
        "name": "Phil Falcone",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/qXYkKPImDiwG5VmZVIHCfO2Pqu3.jpg",
        "filmography": [
            "Terrifier 2 (2022)",
            "Selfie King (2022)",
            "Terrifier (2018)",
            "A Work of Art (2024)",
            "Terrifier 3 (2024)"
        ]
    },
    {
        "id": 1723,
        "name": "Walter Hill",
        "biography": "Walter Hill (born January 10, 1942) is an American film director, screenwriter, and producer. Hill is known for male-dominated action films and revival of the Western. He said in an interview, \"Every film I've done has been a Western,\" and elaborated in another, \"The Western is ultimately a stripped down moral universe that is, whatever the dramatic problems are, beyond the normal avenues of social control and social alleviation of the problem, and I like to do that even within contemporary stories.\"\n\nDescription above from the Wikipedia article Walter Hill (filmmaker), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3CiICrmhaYnirmOMHEaFXYTbsnT.jpg",
        "filmography": [
            "Oleg: The Oleg Vidov Story (2021)",
            "Commemoration: Howard Hawks' 'Rio Bravo' (2007)",
            "Directed by John Ford (1971)",
            "Messiah of Evil (1974)",
            "Baby Driver (2017)",
            "Friedkin Uncut (2018)"
        ]
    },
    {
        "id": 1607016,
        "name": "Coralie Fargeat",
        "biography": "Coralie Fargeat is a French film director and screenwriter. She gained international recognition with her 2017 debut feature film Revenge, for which she received awards from several independent film festivals. This was followed by her second feature, The Substance (2024), a satirical body horror film starring Demi Moore, screened in the main competition at the 2024 Cannes Film Festival, where Fargeat won the Best Screenplay award.",
        "profile_path": "https://image.tmdb.org/t/p/w500/8TlTqFD5RnJGBxxzarpvygZlRXC.jpg",
        "filmography": [
            "Like that's Cinema? (2018)",
            "Beyond Blood (2019)"
        ]
    },
    {
        "id": 10994,
        "name": "Tom DeSanto",
        "biography": "",
        "profile_path": "",
        "filmography": [
            "The We and the I (2012)",
            "Starz Inside: Comic Books Unbound (2008)",
            "X-Men: The Mutant Watch (2000)",
            "Marvel Renaissance (2014)",
            "Iconic (2024)"
        ]
    },
    {
        "id": 10859,
        "name": "Ryan Reynolds",
        "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020). Reynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards.",
        "profile_path": "https://image.tmdb.org/t/p/w500/algQ1VEno2W9SesoArWcZTeF617.jpg",
        "filmography": [
            "X-Men Origins: Wolverine (2009)",
            "Just Friends (2005)",
            "The Amityville Horror (2005)",
            "The In-Laws (2003)",
            "Fireflies in the Garden (2008)"
        ]
    },
    {
        "id": 8103,
        "name": "Mark Nielsen",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/bqojcGtjzHDiUWgcpjbgY1KEyOx.jpg",
        "filmography": []
    },
    {
        "id": 20458,
        "name": "Dede Gardner",
        "biography": "Dorcas Wright 'Dede' Gardner (born October 16, 1967) is an American film producer. She was president since the founding of Plan B Entertainment and currently serving as Co-President with Jeremy Kleiner since 2013. She is a two-time Oscar winner for 12 Years a Slave and Moonlight, the first woman to win two Oscars for Best Picture. Her films Selma, The Tree of Life, The Big Short, Vice, Minari and Women Talking were additionally nominated for the Academy Award for Best Picture.",
        "profile_path": "https://image.tmdb.org/t/p/w500/miYzjRkwcHWI8h1CPODj3bW6Q7W.jpg",
        "filmography": [
            "Reach For The Stars (2019)",
            "Exploring 'The Tree of Life' (2011)",
            "The Zebra Murders ()"
        ]
    },
    {
        "id": 4028,
        "name": "Niki Marvin",
        "biography": "",
        "profile_path": "",
        "filmography": []
    },
    {
        "id": 457,
        "name": "Albert S. Ruddy",
        "biography": "Albert Stotland Ruddy (born March 28, 1930) is a Canadian-American film and television producer. He is known for producing The Godfather (1972) and Million Dollar Baby (2004), both of which won him the Academy Award for Best Picture, as well as co-creating the CBS sitcom Hogan's Heroes (1965–1971).",
        "profile_path": "https://image.tmdb.org/t/p/w500/jSkLkR79OmqYHg0kx4WWXI1TYPP.jpg",
        "filmography": [
            "Easy Riders, Raging Bulls: How the Sex, Drugs and Rock 'n' Roll Generation Saved Hollywood (2003)",
            "The Godfather Legacy (2012)",
            "The Godfather and the Mob (2006)",
            "Stuntwomen: The Untold Hollywood Story (2020)"
        ]
    },
    {
        "id": 1776,
        "name": "Francis Ford Coppola",
        "biography": "Francis Ford Coppola (born April 7, 1939) is an American film director, producer and screenwriter. He is widely acclaimed as one of Hollywood's most celebrated and influential film directors. He epitomized the group of filmmakers known as the New Hollywood, which included George Lucas, Martin Scorsese, Robert Altman, Woody Allen and William Friedkin, who emerged in the early 1970s with unconventional ideas that challenged contemporary filmmaking. He co-authored the script for Patton, winning the Academy Award in 1970. His directorial fame escalated with the release of The Godfather in 1972. The film revolutionized movie-making in the gangster genre, garnering universal laurels from critics and public alike. It went on to win three Academy Awards, including his second, which he won for Best Adapted Screenplay, and it was instrumental in cementing his position as one of the prominent American film directors. Coppola followed it with an equally successful sequel The Godfather Part II, which became the first ever sequel to win the Academy Award for Best Picture. The film received yet higher praises than its predecessor, and gave him three Academy Awards—for Best Adapted Screenplay, Best Director and Best Picture. In the same year was released The Conversation, which he directed, produced and wrote. The film went on to win the Palme d'Or at the 1974 Cannes Film Festival. His next directorial venture was Apocalypse Now in 1979, and it was as notorious for its lengthy and troubled production as it was critically acclaimed for its vivid and stark depiction of the Vietnam War. It won his second Palme d'Or at the 1979 Cannes Film Festival. Although some of Coppola's ventures in the 1980s and early 1990s were critically lauded, Coppola's later work has not met the same level of critical and commercial success as his '70s films. Description above from the Wikipedia article Francis Ford Coppola, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3Pblihd6KjXliie9vj4iQJwbNPU.jpg",
        "filmography": [
            "It's Alive: The True Story of Frankenstein (1994)",
            "Hearts of Darkness: A Filmmaker's Apocalypse (1991)",
            "A Conversation with Martin Sheen (2010)",
            "A Conversation with Martin Scorsese & Francis Ford Coppola (1997)",
            "The Kid Stays in the Picture (2002)"
        ]
    },
    {
        "id": 488,
        "name": "Steven Spielberg",
        "biography": "Steven Allan Spielberg (born December 18, 1946) is an American film director, writer and producer. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director of all time. Spielberg is the recipient of various accolades, including three Academy Awards, a Kennedy Center honor, four Directors Guild of America Awards, two BAFTA Awards, a Cecil B. DeMille Award and an AFI Life Achievement Award. Seven of his films have been inducted into the National Film Registry by the Library of Congress as 'culturally, historically or aesthetically significant'. Spielberg was born in Cincinnati, Ohio, and grew up in Phoenix, Arizona. He moved to California and studied film in college. After directing several episodes for television including Night Gallery and Columbo, he directed the television film Duel (1971) which gained acclaim from critics and audiences. He made his directorial film debut with The Sugarland Express (1974), and became a household name with the 1975 summer blockbuster Jaws. He then directed huge box office successes Close Encounters of the Third Kind (1977), E.T. the Extra-Terrestrial (1982) and the Indiana Jones original trilogy (1981-89). Spielberg subsequently explored drama in the acclaimed The Color Purple (1985) and Empire of the Sun (1987). After a brief hiatus, Spielberg directed the science fiction thriller Jurassic Park (1993), the highest-grossing film ever at the time, and the Holocaust drama Schindler's List (1993), which has often been listed as one of the greatest films ever made. He won the Academy Award for Best Director for the latter and for the 1998 World War II epic Saving Private Ryan. Spielberg continued in the 2000s with science fiction films A.I. Artificial Intelligence (2001), Minority Report (2002) and War of the Worlds (2005). He also directed the adventure films The Adventures of Tintin (2011) and Ready Player One (2018); the historical dramas Amistad (1997), Munich (2005), War Horse (2011), Lincoln (2012), Bridge of Spies (2015) and The Post (2017); the musical West Side Story (2021); and the semi-autobiographical drama The Fabelmans (2022). He has been a producer on several successful films, including Poltergeist (1982), Gremlins (1984), Back to the Future (1985) and Who Framed Roger Rabbit (1988) as well as the miniseries Band of Brothers (2001). Spielberg co-founded Amblin Entertainment and DreamWorks, and has served as a producer for many successful films and television series. He is also known for his long collaboration with the composer John Williams, with whom he has worked for all but five of his feature films. Several of Spielberg's works are among the highest-grossing and greatest films all time. Premiere ranked him first place in the list of 100 Most Powerful People in Movies in 2003. In 2013, Time listed him as one of the 100 most influential people.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tZxcg19YQ3e8fJ0pOs7hjlnmmr6.jpg",
        "filmography": [
            "The Blues Brothers (1980)",
            "Remembering Stanley Kubrick (1999)",
            "TVTV: Video Revolutionaries (2018)",
            "The Masterpiece That Almost Wasn't (2008)",
            "Où est parti E.T. ? L'Enfance selon Spielberg (2023)"
        ]
    },
    {
        "id": 4958,
        "name": "Henry Fonda",
        "biography": "Henry Jaynes Fonda (May 16, 1905 – August 12, 1982) was an American actor who had a career that spanned five decades in Hollywood. Fonda cultivated a strong, appealing screen image in several films now considered to be classics, earning one Academy Award for Best Actor on two nominations. Fonda made his mark early as a Broadway actor and made his Hollywood film debut in 1935. His film career began to gain momentum with roles such as Bette Davis's fiancee in her Academy Award-winning performance in Jezebel (1938), brother Frank in Jesse James (1939), and the future President in Young Mr. Lincoln (1939), directed by John Ford. His early career peaked with his Academy Award-nominated performance as Tom Joad in The Grapes of Wrath, about an Oklahoma family who moved to California during the Dust Bowl 1930s. This film is widely considered to be among the greatest American films. In 1941 he starred opposite Barbara Stanwyck in the screwball comedy classic The Lady Eve. Book-ending his service in WWII were his starring roles in two highly regarded westerns: The Ox-Bow Incident (1943) and My Darling Clementine (1946), the latter directed by John Ford, and he also starred in Ford's western Fort Apache (1948). After a seven-year break from films, during which Fonda focused on stage productions, he returned with the WWII war-boat ensemble Mister Roberts (1955). In 1957 he starred as Juror No.8, the hold-out juror, in 12 Angry Men. Fonda, who was also co-producer, won the BAFTA for Best Foreign Actor. Later in his career, Fonda moved into darker roles, such as the villain in the epic Once Upon a Time in the West (1968), underrated and a box office disappointment at its time of release, but now regarded as one of the best westerns of all time. He also played in lighter-hearted fare such as Yours, Mine and Ours with Lucille Ball, but also often played important military figures, such as a Colonel in Battle of the Bulge (1965), and Admiral Nimitz in Midway (1976). He finally won the Academy Award for Best Actor at the 54th Academy Awards for his final film role in On Golden Pond (1981), which also starred Katharine Hepburn and his daughter Jane Fonda, but was too ill to attend the ceremony. He died from heart disease a few months later. Description above from the Wikipedia article Henry Fonda, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/6wXWsqSXF3wCsGcwVqiszy6RX9X.jpg",
        "filmography": [
            "The Ox-Bow Incident (1943)",
            "Fail Safe (1964)",
            "The Grapes of Wrath (1940)",
            "The Lady Eve (1941)",
            "My Darling Clementine (1946)"
        ]
    },
    {
        "id": 1417,
        "name": "Toshio Suzuki",
        "biography": "Toshio Suzuki is a producer and President at Studio Ghibli. He has produced the work of two of Japan's foremost animators, Isao Takahata and Hayao Miyazaki.",
        "profile_path": "https://image.tmdb.org/t/p/w500/h8KzdSl5kIHgXputSBhxDZ1CA1g.jpg",
        "filmography": [
            "50 Films to See Before You Die (2006)",
            "Whisper of the Heart (1995)",
            "Hideaki Anno: The Final Challenge of Evangelion (2021)",
            "The Making of Ghost in the Shell 2: Innocence (2004)",
            "The Kingdom of Dreams and Madness (2013)"
        ]
    },
    {
        "id": 35770,
        "name": "Yash Chopra",
        "biography": "Yash Raj Chopra was a highly accomplished Indian filmmaker. The founder of film studio, Yash Raj Films - he was responsible for some of the most popular Bollywood films to come out of India in the past 40 years. Chopra won several prestigious awards including the Filmfare Award for Best Director, the Dadasaheb Phalke Award and Padma Bhushan.",
        "profile_path": "https://image.tmdb.org/t/p/w500/uDthb94NlawtgRT8BKufFkZdJR5.jpg",
        "filmography": [
            "Cinema Asia: India (2007)",
            "Akarshan (1988)",
            "Veer-Zaara (2004)",
            "Om Shanti Om (2007)",
            "Celluloid Man (2012)"
        ]
    },
    {
        "id": 525,
        "name": "Christopher Nolan",
        "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan.",
        "profile_path": "https://image.tmdb.org/t/p/w500/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
        "filmography": [
            "Batman Unmasked: The Psychology of The Dark Knight (2008)",
            "Heath Ledger: A Tribute (2009)",
            "These Amazing Shadows (2011)",
            "To End All War: Oppenheimer & the Atomic Bomb (2023)",
            "Side by Side (2012)"
        ]
    },
    {
        "id": 3718,
        "name": "David Valdes",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/4gbCUGBWd4WeRsu9DeknpJUMlvz.jpg",
        "filmography": [
            "Tightrope (1984)",
            "Walking the Mile (2014)",
            "Beyond the 'Open Range' (2004)",
            "Clint Eastwood's West (2011)",
            "Walking the Mile: The Making of The Green Mile (2000)"
        ]
    },
    {
        "id": 67159,
        "name": "Christopher Tuffin",
        "biography": "",
        "profile_path": "",
        "filmography": []
    },
    {
        "id": 2626037,
        "name": "Zainab Azizi",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/yBU2NGSBDO1DoMYN66JSBXnWFdT.jpg",
        "filmography": [
            "Boy Kills World (2024)"
        ]
    },
    {
        "id": 967604,
        "name": "Dimitri Rassam",
        "biography": "Dimitri Rassam (born 16 November 1981) is a Lebanese-French film producer and a member of the Monegasque princely family through marriage. Rassam is the son of actress Carole Bouquet and film producer Jean-Pierre Rassam. He has one half-brother, Louis, born in 1987 to his mother's relationship with the photographer Francis Giacobetti. Rassam was four years old when his father died from a drug overdose. Rassam finished secondary school at École Active Bilingue with a Bac scientifique, then prepped at Sciences Po. He began work on a business degree at HEC Paris, but changed course to earn a degree in history (from the Sorbonne) instead. At the age of 23, Rassam founded the production company 'Chapter 2'. His first credit as producer was the film Judas, directed by Nicolas Bury and Jérôme Fansten in 2006. In 2014, 'Chapter 2' merged with Alexis Vonarb's Onyx Films and Aton Soumache's Method Animation to form 'ON Entertainment'. Method Animation is the parent company, with Soumache as CEO and Mediawan, which founded by Xavier Niel, Matthieu Pigasse, and Pierre-Antoine Capton as ultimate owner since 2018. Rassam has worked with various directors of animation films, including Mark Osborne, director of Kung Fu Panda and The Little Prince. Source: Article 'Dimitri Rassam' from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "profile_path": "https://image.tmdb.org/t/p/w500/x4i2MOnVdKJRXGkeAHr2Htb0xVM.jpg",
        "filmography": [
            "The Family (2023)"
        ]
    }
]