[
    {
        "id": 7626,
        "name": "Avi Arad",
        "biography": "Avi Arad is an Israeli-American businessman. He became the CEO of the company Toy Biz in the 1990s, and soon afterward became the chief creative officer of Marvel Entertainment, a Marvel director, and the chairman, CEO, and founder of Marvel Studios.",
        "profile_path": "https://image.tmdb.org/t/p/w500/cxmqw0anGfxC7RwUNQj3EwhX9pP.jpg",
        "filmography": [
            "Spider-Man: All Roads Lead to No Way Home (2022)",
            "Metal Gear Solid: Legacy (2015)",
            "X-Men: The Mutant Watch (2000)",
            "Starz Inside: Comic Books Unbound (2008)",
            "Beyond Hell's Kitchen - Making Daredevil (2003)"
        ]
    },
    {
        "id": 1847451,
        "name": "Jeff Hermann",
        "biography": "",
        "profile_path": "",
        "filmography": [
            "Ouch (1990)"
        ]
    },
    {
        "id": 1805438,
        "name": "Phil Falcone",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/qXYkKPImDiwG5VmZVIHCfO2Pqu3.jpg",
        "filmography": [
            "Terrifier 2 (2022)",
            "Selfie King (2022)",
            "Terrifier (2018)",
            "A Work of Art (2024)",
            "Terrifier 3 (2024)"
        ]
    },
    {
        "id": 1723,
        "name": "Walter Hill",
        "biography": "Walter Hill (born January 10, 1942) is an American film director, screenwriter, and producer. Hill is known for male-dominated action films and revival of the Western. He said in an interview, \"Every film I've done has been a Western,\" and elaborated in another, \"The Western is ultimately a stripped down moral universe that is, whatever the dramatic problems are, beyond the normal avenues of social control and social alleviation of the problem, and I like to do that even within contemporary stories.\"\n\nDescription above from the Wikipedia article Walter Hill (filmmaker), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3CiICrmhaYnirmOMHEaFXYTbsnT.jpg",
        "filmography": [
            "Oleg: The Oleg Vidov Story (2021)",
            "Commemoration: Howard Hawks' 'Rio Bravo' (2007)",
            "Directed by John Ford (1971)",
            "Messiah of Evil (1974)",
            "Baby Driver (2017)",
            "Friedkin Uncut (2018)"
        ]
    },
    {
        "id": 1607016,
        "name": "Coralie Fargeat",
        "biography": "Coralie Fargeat is a French film director and screenwriter. She gained international recognition with her 2017 debut feature film Revenge, for which she received awards from several independent film festivals. This was followed by her second feature, The Substance (2024), a satirical body horror film starring Demi Moore, screened in the main competition at the 2024 Cannes Film Festival, where Fargeat won the Best Screenplay award.",
        "profile_path": "https://image.tmdb.org/t/p/w500/8TlTqFD5RnJGBxxzarpvygZlRXC.jpg",
        "filmography": [
            "Like that's Cinema? (2018)",
            "Beyond Blood (2019)"
        ]
    },
    {
        "id": 10994,
        "name": "Tom DeSanto",
        "biography": "",
        "profile_path": "",
        "filmography": [
            "The We and the I (2012)",
            "Starz Inside: Comic Books Unbound (2008)",
            "X-Men: The Mutant Watch (2000)",
            "Marvel Renaissance (2014)",
            "Iconic (2024)"
        ]
    },
    {
        "id": 10859,
        "name": "Ryan Reynolds",
        "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020). Reynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards.",
        "profile_path": "https://image.tmdb.org/t/p/w500/algQ1VEno2W9SesoArWcZTeF617.jpg",
        "filmography": [
            "X-Men Origins: Wolverine (2009)",
            "Just Friends (2005)",
            "The Amityville Horror (2005)",
            "The In-Laws (2003)",
            "Fireflies in the Garden (2008)"
        ]
    },
    {
        "id": 8103,
        "name": "Mark Nielsen",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/bqojcGtjzHDiUWgcpjbgY1KEyOx.jpg",
        "filmography": []
    },
    {
        "id": 20458,
        "name": "Dede Gardner",
        "biography": "Dorcas Wright 'Dede' Gardner (born October 16, 1967) is an American film producer. She was president since the founding of Plan B Entertainment and currently serving as Co-President with Jeremy Kleiner since 2013. She is a two-time Oscar winner for 12 Years a Slave and Moonlight, the first woman to win two Oscars for Best Picture. Her films Selma, The Tree of Life, The Big Short, Vice, Minari and Women Talking were additionally nominated for the Academy Award for Best Picture.",
        "profile_path": "https://image.tmdb.org/t/p/w500/miYzjRkwcHWI8h1CPODj3bW6Q7W.jpg",
        "filmography": [
            "Reach For The Stars (2019)",
            "Exploring 'The Tree of Life' (2011)",
            "The Zebra Murders ()"
        ]
    },
    {
        "id": 4028,
        "name": "Niki Marvin",
        "biography": "",
        "profile_path": "",
        "filmography": []
    },
    {
        "id": 457,
        "name": "Albert S. Ruddy",
        "biography": "Albert Stotland Ruddy (born March 28, 1930) is a Canadian-American film and television producer. He is known for producing The Godfather (1972) and Million Dollar Baby (2004), both of which won him the Academy Award for Best Picture, as well as co-creating the CBS sitcom Hogan's Heroes (1965–1971).",
        "profile_path": "https://image.tmdb.org/t/p/w500/jSkLkR79OmqYHg0kx4WWXI1TYPP.jpg",
        "filmography": [
            "Easy Riders, Raging Bulls: How the Sex, Drugs and Rock 'n' Roll Generation Saved Hollywood (2003)",
            "The Godfather Legacy (2012)",
            "The Godfather and the Mob (2006)",
            "Stuntwomen: The Untold Hollywood Story (2020)"
        ]
    },
    {
        "id": 1776,
        "name": "Francis Ford Coppola",
        "biography": "Francis Ford Coppola (born April 7, 1939) is an American film director, producer and screenwriter. He is widely acclaimed as one of Hollywood's most celebrated and influential film directors. He epitomized the group of filmmakers known as the New Hollywood, which included George Lucas, Martin Scorsese, Robert Altman, Woody Allen and William Friedkin, who emerged in the early 1970s with unconventional ideas that challenged contemporary filmmaking. He co-authored the script for Patton, winning the Academy Award in 1970. His directorial fame escalated with the release of The Godfather in 1972. The film revolutionized movie-making in the gangster genre, garnering universal laurels from critics and public alike. It went on to win three Academy Awards, including his second, which he won for Best Adapted Screenplay, and it was instrumental in cementing his position as one of the prominent American film directors. Coppola followed it with an equally successful sequel The Godfather Part II, which became the first ever sequel to win the Academy Award for Best Picture. The film received yet higher praises than its predecessor, and gave him three Academy Awards—for Best Adapted Screenplay, Best Director and Best Picture. In the same year was released The Conversation, which he directed, produced and wrote. The film went on to win the Palme d'Or at the 1974 Cannes Film Festival. His next directorial venture was Apocalypse Now in 1979, and it was as notorious for its lengthy and troubled production as it was critically acclaimed for its vivid and stark depiction of the Vietnam War. It won his second Palme d'Or at the 1979 Cannes Film Festival. Although some of Coppola's ventures in the 1980s and early 1990s were critically lauded, Coppola's later work has not met the same level of critical and commercial success as his '70s films. Description above from the Wikipedia article Francis Ford Coppola, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/3Pblihd6KjXliie9vj4iQJwbNPU.jpg",
        "filmography": [
            "It's Alive: The True Story of Frankenstein (1994)",
            "Hearts of Darkness: A Filmmaker's Apocalypse (1991)",
            "A Conversation with Martin Sheen (2010)",
            "A Conversation with Martin Scorsese & Francis Ford Coppola (1997)",
            "The Kid Stays in the Picture (2002)"
        ]
    },
    {
        "id": 488,
        "name": "Steven Spielberg",
        "biography": "Steven Allan Spielberg (born December 18, 1946) is an American film director, writer and producer. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director of all time. Spielberg is the recipient of various accolades, including three Academy Awards, a Kennedy Center honor, four Directors Guild of America Awards, two BAFTA Awards, a Cecil B. DeMille Award and an AFI Life Achievement Award. Seven of his films have been inducted into the National Film Registry by the Library of Congress as 'culturally, historically or aesthetically significant'. Spielberg was born in Cincinnati, Ohio, and grew up in Phoenix, Arizona. He moved to California and studied film in college. After directing several episodes for television including Night Gallery and Columbo, he directed the television film Duel (1971) which gained acclaim from critics and audiences. He made his directorial film debut with The Sugarland Express (1974), and became a household name with the 1975 summer blockbuster Jaws. He then directed huge box office successes Close Encounters of the Third Kind (1977), E.T. the Extra-Terrestrial (1982) and the Indiana Jones original trilogy (1981-89). Spielberg subsequently explored drama in the acclaimed The Color Purple (1985) and Empire of the Sun (1987). After a brief hiatus, Spielberg directed the science fiction thriller Jurassic Park (1993), the highest-grossing film ever at the time, and the Holocaust drama Schindler's List (1993), which has often been listed as one of the greatest films ever made. He won the Academy Award for Best Director for the latter and for the 1998 World War II epic Saving Private Ryan. Spielberg continued in the 2000s with science fiction films A.I. Artificial Intelligence (2001), Minority Report (2002) and War of the Worlds (2005). He also directed the adventure films The Adventures of Tintin (2011) and Ready Player One (2018); the historical dramas Amistad (1997), Munich (2005), War Horse (2011), Lincoln (2012), Bridge of Spies (2015) and The Post (2017); the musical West Side Story (2021); and the semi-autobiographical drama The Fabelmans (2022). He has been a producer on several successful films, including Poltergeist (1982), Gremlins (1984), Back to the Future (1985) and Who Framed Roger Rabbit (1988) as well as the miniseries Band of Brothers (2001). Spielberg co-founded Amblin Entertainment and DreamWorks, and has served as a producer for many successful films and television series. He is also known for his long collaboration with the composer John Williams, with whom he has worked for all but five of his feature films. Several of Spielberg's works are among the highest-grossing and greatest films all time. Premiere ranked him first place in the list of 100 Most Powerful People in Movies in 2003. In 2013, Time listed him as one of the 100 most influential people.",
        "profile_path": "https://image.tmdb.org/t/p/w500/tZxcg19YQ3e8fJ0pOs7hjlnmmr6.jpg",
        "filmography": [
            "The Blues Brothers (1980)",
            "Remembering Stanley Kubrick (1999)",
            "TVTV: Video Revolutionaries (2018)",
            "The Masterpiece That Almost Wasn't (2008)",
            "Où est parti E.T. ? L'Enfance selon Spielberg (2023)"
        ]
    },
    {
        "id": 4958,
        "name": "Henry Fonda",
        "biography": "Henry Jaynes Fonda (May 16, 1905 – August 12, 1982) was an American actor who had a career that spanned five decades in Hollywood. Fonda cultivated a strong, appealing screen image in several films now considered to be classics, earning one Academy Award for Best Actor on two nominations. Fonda made his mark early as a Broadway actor and made his Hollywood film debut in 1935. His film career began to gain momentum with roles such as Bette Davis's fiancee in her Academy Award-winning performance in Jezebel (1938), brother Frank in Jesse James (1939), and the future President in Young Mr. Lincoln (1939), directed by John Ford. His early career peaked with his Academy Award-nominated performance as Tom Joad in The Grapes of Wrath, about an Oklahoma family who moved to California during the Dust Bowl 1930s. This film is widely considered to be among the greatest American films. In 1941 he starred opposite Barbara Stanwyck in the screwball comedy classic The Lady Eve. Book-ending his service in WWII were his starring roles in two highly regarded westerns: The Ox-Bow Incident (1943) and My Darling Clementine (1946), the latter directed by John Ford, and he also starred in Ford's western Fort Apache (1948). After a seven-year break from films, during which Fonda focused on stage productions, he returned with the WWII war-boat ensemble Mister Roberts (1955). In 1957 he starred as Juror No.8, the hold-out juror, in 12 Angry Men. Fonda, who was also co-producer, won the BAFTA for Best Foreign Actor. Later in his career, Fonda moved into darker roles, such as the villain in the epic Once Upon a Time in the West (1968), underrated and a box office disappointment at its time of release, but now regarded as one of the best westerns of all time. He also played in lighter-hearted fare such as Yours, Mine and Ours with Lucille Ball, but also often played important military figures, such as a Colonel in Battle of the Bulge (1965), and Admiral Nimitz in Midway (1976). He finally won the Academy Award for Best Actor at the 54th Academy Awards for his final film role in On Golden Pond (1981), which also starred Katharine Hepburn and his daughter Jane Fonda, but was too ill to attend the ceremony. He died from heart disease a few months later. Description above from the Wikipedia article Henry Fonda, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "profile_path": "https://image.tmdb.org/t/p/w500/6wXWsqSXF3wCsGcwVqiszy6RX9X.jpg",
        "filmography": [
            "The Ox-Bow Incident (1943)",
            "Fail Safe (1964)",
            "The Grapes of Wrath (1940)",
            "The Lady Eve (1941)",
            "My Darling Clementine (1946)"
        ]
    },
    {
        "id": 1417,
        "name": "Toshio Suzuki",
        "biography": "Toshio Suzuki is a producer and President at Studio Ghibli. He has produced the work of two of Japan's foremost animators, Isao Takahata and Hayao Miyazaki.",
        "profile_path": "https://image.tmdb.org/t/p/w500/h8KzdSl5kIHgXputSBhxDZ1CA1g.jpg",
        "filmography": [
            "50 Films to See Before You Die (2006)",
            "Whisper of the Heart (1995)",
            "Hideaki Anno: The Final Challenge of Evangelion (2021)",
            "The Making of Ghost in the Shell 2: Innocence (2004)",
            "The Kingdom of Dreams and Madness (2013)"
        ]
    },
    {
        "id": 35770,
        "name": "Yash Chopra",
        "biography": "Yash Raj Chopra was a highly accomplished Indian filmmaker. The founder of film studio, Yash Raj Films - he was responsible for some of the most popular Bollywood films to come out of India in the past 40 years. Chopra won several prestigious awards including the Filmfare Award for Best Director, the Dadasaheb Phalke Award and Padma Bhushan.",
        "profile_path": "https://image.tmdb.org/t/p/w500/uDthb94NlawtgRT8BKufFkZdJR5.jpg",
        "filmography": [
            "Cinema Asia: India (2007)",
            "Akarshan (1988)",
            "Veer-Zaara (2004)",
            "Om Shanti Om (2007)",
            "Celluloid Man (2012)"
        ]
    },
    {
        "id": 525,
        "name": "Christopher Nolan",
        "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan.",
        "profile_path": "https://image.tmdb.org/t/p/w500/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
        "filmography": [
            "Batman Unmasked: The Psychology of The Dark Knight (2008)",
            "Heath Ledger: A Tribute (2009)",
            "These Amazing Shadows (2011)",
            "To End All War: Oppenheimer & the Atomic Bomb (2023)",
            "Side by Side (2012)"
        ]
    },
    {
        "id": 3718,
        "name": "David Valdes",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/4gbCUGBWd4WeRsu9DeknpJUMlvz.jpg",
        "filmography": [
            "Tightrope (1984)",
            "Walking the Mile (2014)",
            "Beyond the 'Open Range' (2004)",
            "Clint Eastwood's West (2011)",
            "Walking the Mile: The Making of The Green Mile (2000)"
        ]
    },
    {
        "id": 67159,
        "name": "Christopher Tuffin",
        "biography": "",
        "profile_path": "",
        "filmography": []
    },
    {
        "id": 2626037,
        "name": "Zainab Azizi",
        "biography": "",
        "profile_path": "https://image.tmdb.org/t/p/w500/yBU2NGSBDO1DoMYN66JSBXnWFdT.jpg",
        "filmography": [
            "Boy Kills World (2024)"
        ]
    },
    {
        "id": 967604,
        "name": "Dimitri Rassam",
        "biography": "Dimitri Rassam (born 16 November 1981) is a Lebanese-French film producer and a member of the Monegasque princely family through marriage. Rassam is the son of actress Carole Bouquet and film producer Jean-Pierre Rassam. He has one half-brother, Louis, born in 1987 to his mother's relationship with the photographer Francis Giacobetti. Rassam was four years old when his father died from a drug overdose. Rassam finished secondary school at École Active Bilingue with a Bac scientifique, then prepped at Sciences Po. He began work on a business degree at HEC Paris, but changed course to earn a degree in history (from the Sorbonne) instead. At the age of 23, Rassam founded the production company 'Chapter 2'. His first credit as producer was the film Judas, directed by Nicolas Bury and Jérôme Fansten in 2006. In 2014, 'Chapter 2' merged with Alexis Vonarb's Onyx Films and Aton Soumache's Method Animation to form 'ON Entertainment'. Method Animation is the parent company, with Soumache as CEO and Mediawan, which founded by Xavier Niel, Matthieu Pigasse, and Pierre-Antoine Capton as ultimate owner since 2018. Rassam has worked with various directors of animation films, including Mark Osborne, director of Kung Fu Panda and The Little Prince. Source: Article 'Dimitri Rassam' from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "profile_path": "https://image.tmdb.org/t/p/w500/x4i2MOnVdKJRXGkeAHr2Htb0xVM.jpg",
        "filmography": [
            "The Family (2023)"
        ]
    }
]